package project.bc.nu.projects.managervegetable;

import android.os.Bundle;
import android.support.v7.app.AlertDialog;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.widget.EditText;
import android.widget.ImageView;
import android.widget.Toast;

import project.bc.nu.projects.R;
import project.bc.nu.projects.SQLite.MyDB;
import project.bc.nu.projects.SQLite.myDBClass;

public class AddVegActivityManager extends AppCompatActivity {

    private int REQUEST_CODE_GALLERY = 100;
    ImageView imageView;
    EditText tVegNameTH;
    EditText tVegNameCM;
    EditText tVegNameSC;
    EditText tVegStructure;
    EditText tVegNutrient;
    EditText tVegPlant;
    EditText tVegTreatment;
    EditText tNameImageVeg;
    public static MyDB myDB;

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_manager_add_veg);
        final MyDB myDb = new MyDB(this);
/*

        myDb.InsertDataVeg("กะหล่ำดอก","Cauliflower","Brassica oleracea L. var. botrytis L. Cruciferae ","ลำต้นเป็นพืชล้มลุก อยู่เป็นช่อ \nใบเป็นใบเดี่ยว มีลักษณะรูปไข่ \nดอกเป็นดอกเดี่ยว มีดอกขนาดเล็กๆ\n","1. ช่วยแก้อาการปวดศีรษะชนิดเรื้อรัง  \n" +
                        "2. ช่วยรักษาโรคหอบหืด\n","\"ระยะปลูก ระยะปลูกระหว่างต้น 50 – 70 เซนติเมตร ระยะระหว่างแถว 100 – 120 เซนติเมตร\n" +
                        "การเตรียมดิน ไถดินให้ลึกประมาณ 30-40 เซนติเมตรตากดินไว้ 1-2 อาทิตย์แล้วย่อยดินให้ละเอียดหว่านปูนขาว ในอัตรา 100 – 300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15-15 -15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                        "การเตรียมกล้า การเพาะกล้า หลังจากเตรียมแปลงเพาะกล้าแล้วให้หว่านเมล็ดกะหล่ำปลีให้กระจายทั่วแปลง หรืออาจจะใช้ทำเป็นแถวห่างกันแถวละ 15 เซนติเมตรทำร่องลึกประมาณ 1 เซนติเมตร แล้วโรยเมล็ดลงในร่องแล้วหว่านกลบด้วยปุ๋ยคอกหรือปุ๋ยหมักหรือดินละเอียด หนาประมาณ 0.5 – 1.0 เซนติเมตรรดน้ำให้ชุ่มแล้วคลุมด้วยฟางแห้ง หรือหญ้าแห้งบาง ๆ หลังจากต้นกล้างอกได้ 15 – 20 วัน ให้ถอนแยกต้นที่ไม่สมบูรณ์หรือต้นที่อ่อนแอออก พร้อมกันนี้พยายามจัดระยะกล้าให้ห่างกันประมาณ 10 เซนติเมตรย้ายปลูกเมื่ออายุ 25 - 30 วัน วิธีปลูกหลังจากเตรียมแปลงปลูก และขุดหลุมปลูกตามระยะที่กำหนดแล้ว จึงย้ายกล้ามาปลูก ต้นกล้าที่ย้ายปลูกควรแข็งแรงมีอายุประมาณ 25 - 30 วันการถอนกล้าควรมีดินติดรากมาด้วย และทำอย่างต้นกล้าที่ย้ายมาต้องรีบปลูกทันทีการปลูกควรกดดินโคนต้นให้แน่น หลังจากปลูกแล้วรดน้ำให้ชุ่ม"
                ,"การใส่ปุ๋ย กะหล่ำปลี เป็นผักที่ต้องการปุ๋ยมาก ควรใส่ปุ๋ย 46-0-0 อัตรา 30 กิโลกรัม/ไร่ หลังย้ายปลูก7-10 วัน หลังปลูก 20 วัน ควรใส่ปุ๋ย 15-15-15อัตรา 50 กิโลกรัม /ไร่ และหลังปลูก 40 วัน(ก่อนกะหล่ำปลีเข้าหัว)ควรใส่ปุ๋ยสูตร 13-13 -21หรือ 14-14-21 อัตรา 50กิโลกรัม/ไร่ และควรมีการฉีดพ่นปุ๋ยที่มีธาตุโบรอนผสมหรือพ่นธาตุโบรอนอย่างเดียวในอัตรา 10 -12 กรัม/น้ำ 20 ลิตรเป็นครั้งคราว\n" +
                        "การเก็บเกี่ยว อายุการเก็บเกี่ยวของกะหล่ำปลีขึ้นอยู่กับลักษณะของแต่ละพันธุ์ พันธุ์เบาประมาณ 50 – 60 วันส่วนพันธุ์หนักมีอายุประมาณ 120 วัน ควรเก็บหัวที่ห่อแน่น และมีขนาดพอเหมาะ โดยกะหล่ำปลีจะมีน้ำหนักประมาณ 1 — 2 กิโลกรัม/ต้น","ส่วนกินดอก","กะหล่ำดอก","1.png");



        myDb.InsertDataVeg("ขจร","Cowslip creeper","Telosma cordata (Burm. f.) Merr.","\"เป็นไม้เลื้อยเถาเล็กแตกยอดจำนวนมาก ทุกส่วนของลำต้นมีน้ำยางขาว \n" +
                "ใบเป็นใบเดี่ยว ช่อดอกสีเหลืองอมชมพู อ่อน ออก เป็นช่อแบบซี่ร่ม \n" +
                "ดอกย่อยมีกลีบเลี้ยงเชื่อมติดกันส่วนปลายแยก 5 แฉกกลีบดอกเชื่อมติดกัน\n" +
                "เป็นหลอดสั้นๆ ปลายกลีบ แยก เป็น 5 แฉก ดอกบานไม่พร้อมกันดอกอ่อนสีเขียว \"\n","\"1. ช่วยบำรุงโลหิต \n" +
                "2. ช่วยรักษาโลหิตเป็นพิษ\n" +
                "3. ช่วยบำรุงหัวใจ","\"การเตรียมดิน ไถพรวน แล้วย่อยดินให้ละเอียด ยกร่องแปลงกว้าง 1 เมตร ยาวประมาณ 3 – 4 เมตร ระยะหว่างต้น 5 เมตร ขุดหลุมลึกประมาณ 50 เซนติเมตร กว้าง 50 เซนติเมตร รองก้นหลุมด้วยปุ๋ยคอกหรือปุ๋ยสูตร 15 – 15 – 15 อัตรา 10 – 20 กรัมต่อหลุม\n" +
                "การเตรียมกล้า การปักชำกิ่ง เลือกกิ่งที่แข็งแรงมาปักชำ\n" +
                "วิธีปลูก นำกิ่งชำที่มีนากแข็งแรง หรือต้นกล้ามาปลูก รดน้ำ 3 – 5 วันต่อครั้ง ตามสะภาพความชื้นของดินและเมื่ออายุประมาณ 10 – 15 วัน ปักค้างเพื่อให้ต้นขจรเลื้อยขึ้นค้างหลังปลูก\"\n","\"การใส่ปุ๋ย ประมาณ 1 เดือน ใส่ปุ๋ยสูตร 15 – 15 - 15  อัตรา 10 กรัม ต่อหลุม\n" +
                "การเก็บเกี่ยว หลังจากปลุกได้ 30 วัน ขจรจะเริ่มออกดอกและให้ผลผลิตมากที่สุด เมื่ออายุ 8 – 10 เดือน โดยเฉพาะในช่วงเดือนพฤษภาคม – กรกฎาคม และผลผลิตจะเริ่มลดลงในช่วงเดือน พฤศจิกายน – ธันวาคม เพราะเป็นช่วงฤดูหนาว\"\n","ส่วนกินดอก\n","ขจร","2.png");



        myDb.InsertDataVeg("กระเจี๊ยบเขียว","Okra, Lady’s finger, Gombo","Abelmoschus esculentus (L.) Moench","แตงกวาเป็นพืชล้มลุก ใบมีก้านใบยาว 5 – 15 เซนติเมตร \n" +
                "ใบหยาบมีขนใบ มีมุมใบ 3 ถึง 5 มุม ปลายใบแหลม ใบใหญ่มี เส้นใบ 5 – 7 เส้น \n" +
                "ดอกเพศเมียเป็นดอกเดี่ยว กลีบเลี้ยงสีเขียว 5 กลีบ กลีบดอกสีเหลือง 5 กลีบ ดอกตัวผู้เป็นดอกเดี่ยว \n" +
                "ผลแตงกวามีลักษณะเรียวยาวทรงกระบอก มีใส้ภายในผล ความยาวระหว่างผล 5- 40 เซนติเมตร","1. ช่วยกำจัดของเสียที่ตกค้างในร่างกาย \n" +
                "2. ผลและเมล็ดอ่อนมีฤทธิ์ช่วยต่อต้านมะเร็ง\n" +
                "3. ช่วยลดความดันโลหิต","ระยะปลูก ขึ้นอยู่กับพันธุ์โดยทั่วไป 60 – 80 * 60 – 80 เซนติเมตร\n" +
                "การเตรียมดิน ไถพรวนดินตากกิน 15 วัน ขุดหลุม ใส่ปุ๋ยสูตร 15 – 15 – 15 อัตรา 20 กิโลกรัมต่อไร่ ใส่อินทรีวัตถุ 2 ตันต่อไร้ ปรับสภาพดินเป็นกรด ด่าง ของดินให้มีค่า 6.5 – 7.5 \n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "วิธีปลูก หยอดเมล็ด หลุมละ 2 – 3 เมล็ด\n" +
                "","การใส่ปุ๋ย อายุ 10 วัน หลังปลูก ใส่ปุ๋ย 15 – 15 – 15 อัตรา 20 กิโลกรัมต่อไร่ และใส่ทุก 20 วัน อัตรา 20 – 25 กิโลกรัมต่อไร่ ควรหลีกเลี่ยงใส่ปุ๋ยที่มีไนโตรเจนสูง\n" +
                "การเก็บเกี่ยว อายุ 45 วันเริ่มเก็บผลผลิต เก็บผลผลิตได้ทุกวันนาน 45 – 60 วัน ควรเก็บในช่วงเวลา 06.00-10.00 น. ตัดขั้วให้ตรง มีก้านติดไม่เกิน 1 เซนติเมตร ตัดใบทิ้งครั้งละใบพร้อมการตัดฝักทุกครั้ง","ส่วนกินฝัก/ผล","กระเจี๊ยบเขียว","3.png");



        myDb.InsertDataVeg("แตงกวา","Cucumber","Cucumis sativus L.","แตงกวาเป็นพืชล้มลุก ลำต้นเป็นเถาเลื้อย ใบมีก้านใบยาว 5 – 15 เซนติเมตร\n" +
                "ใบหยาบมีขนใบ มีมุมใบ 3 ถึง 5 มุม ปลายใบแหลม ใบใหญ่มี เส้นใบ 5 – 7 เส้น\n" +
                "ดอกเพศเมียเป็นดอกเดี่ยว กลีบเลี้ยงสีเขียว 5 กลีบ กลีบดอกสีเหลือง 5 กลีบ ดอกตัวผู้เป็นดอกเดี่ยว\n" +
                "ผลแตงกวามีลักษณะเรียวยาวทรงกระบอก มีใส้ภายในผล ความยาวระหว่างผล 5- 40 เซนติเมตร \n" +
                "ผล กลมยาวทรงกระบอก\n" +
                "","1. ช่วยกำจัดของเสียที่ตกค้างในร่างกาย \n" +
                "2. ผลและเมล็ดอ่อนมีฤทธิ์ช่วยต่อต้านมะเร็ง\n" +
                "3. ช่วยลดความดันโลหิต","ระยะปลูก ปลูกระหว่างต้น 60-80 เซนติเมตร ระหว่างแถว 100 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึก 30-40 เซนติเมตร ตากดินให้ 7- 10 วัน ย่อยดินให้ละเอียดหว่านปูนขาวในอัตรา 100-200 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอกอัตรา 2,000 กิโลกรัม/ไร่ และปุ๋ยสูตร 46-0-0 ผสมสูตร 15-15-15 อย่างละเท่า ๆ กัน อัตรา 30-50 กิโลกรัม/ไร่ คลุกเคล้าในแปลง ยกแปลงสูงประมาร 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "วิธีปลูก นำเมล็ดหยอดตามหลุม 3-4 เมล็ด กลบดินและรดน้ำ เมื่อกล้างอกมีใบจริง 2-3 ใบ ถอนต้นไม่สมบูรณ์ออกเหลือ 2 ต้นหลังปลูก 14 วันควรเด็ดกิ่งแขนง 5 ข้อแรก (ใบ) จากพื้นดินออกแล้วจึงเริ่มปล่อยให้ติดผล หากาต้องการคุณภาพที่ดีเถาที่แตกใหม่ควรควยคุมให้มี 2 ข้อ โดยตัดเหนือข้อ ที่ 2 ผลผลิตจะทยอยออกสม่ำเสมอ ทำค้างรูปสามเหลี่ยม (กระโจม) สูง 1080-2.00 เมตร ควรทำการปักไม้ค้างหลัง\n"
                ,"การใส่ปุ๋ย หลังปลูก 7-15 วัน ใส่ปุ๋ยสูตร 46-0-0 อัตรา 30 กิโลกรัม/ไร่ เพื่อเร่งการเจริญเติบโต และผลผลิต จึงควรให้เป็น ระยะ ๆ หลังจากใส่ปุ๋ย ครั้งแรก 15-20 วันให้ใส่ปุ๋ย สูตร 46-0-0 ผสมปุ๋ย สูตร 15-15-15 สัดส่วน 1:2 อัตรา 30-50 กิโลกรัม/ไร่ สำหรับในช่วงออกดอก - ติดผลให้ใส่ปุ๋ยสูตร 13-13-21 อัตรา 30 กิโลกรัม/ไร่โดยใส่ทุก ๆ 10 วันปลูกไม่เกิน 7 วัน หากทำช้าอาจจะปักไม้ค้างโดนราก ทำให้รากขาดกระทบต่อการเจริญเติบโตของพืช\n" +
                        "การเก็บเกี่ยว เก็บเกี่ยวผลแตงกวาในขณะเมล็ดภายในยังอ่อน หรือเก็บในขณะที่สีของผลเปลี่ยนจากสีเขียวเป็นสีเขียวเข้ม หรือเก็บในขณะที่เปลือกยังอ่อนอย่าปล่อยให้ผลแก่ค่าต้นเพราะจะทำให้ผลผลิตลดลง ระยะเวลาในการเก็บเกี่ยวประมาณ 5 เดือนและจะเก็บเกี่ยวได้ประมาณ 30-35 วัน และจะเก็บเกี่ยวหลังจากดอกบาน 10-20 วัน","ส่วนกินฝัก/ผล","แตงกวา","4.png");


        myDb.InsertDataVeg("ถั่วฝักยาว","Yard long bean","Vigna unguiculata (L.) Walp.","มีอายุเพียงปีเดียวหรือฤดูเดียวเถาสีเขียวอ่อน ลำต้นม้วนพันสิ่งยึดเกาะได้ดี\n" +
                "ใบเป็นใบประกอบแบบฝ่ามือ มี 3 ใบย่อย รูปสามเหลี่ยมยาว 6 -10 เซนติเมตร\n","1. ช่วยบำรุงกระดูกและฟัน \n" +
                "2. ช่วยป้องกันการเกิดโรคกระดูกพรุน \n" +
                "3. ฟอสฟอรัสมีส่วนช่วยเผาผลาญคาร์โบไฮเดรต ไขมัน และโปรตีน","ระยะปลูก ระหว่างแถว70-100 เซนติเมตร ระหว่างต้น40-50 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินลึก20 เซนติเมตร ใส่ปุ๋ยคอกหรือปูนขาว(ถ้าจำเป็น) ทิ้งไว้2-3 อาทิตย์ ใส่ปุ๋ยคอกรองพื้นอัตรา2 ตัน/ไร่ และใส่ปุ๋ยเคมีสูตร15-15-15 อัตรา 30 กิโลกรัม/ไร่\n" +
                "การเตรียมกล้า เตรียมเมล็ดพันธุ์\n" +
                "วิธีปลูก ปลูกโดยหยอดเมล็ด 3 เมล็ด/หลุมหลังปลูกแล้วกลบเมล็ดด้วยแกลบหรือปุ๋ยคอก 2-3 กำมือ/หลุมหลังปลูก 7-15 วันเมื่อเริ่มมี ใบ2-3 ใบเลือกต้นที่สมบูรณ์ไว้ 2 ต้น/หลุม ใช้ ไม้ทำค้างปักหลุมละ 1 อัน สูง 2.50 เมตรปักเอียงเข้าหากิ่งกลางเป็นคู่ ๆแล้วมัดเข้าด้วยกัน เสร็จแล้วใช้ไม้ค้างพาดกลางมัดยึดอีกทีหนึ่งแล้วคลุมด้วยตาข่าย","การใส่ปุ๋ย หลังปลูก20 วัน ใส่ปุ๋ยสูตร 46-0-0 อัตรา 20 กิโลกรัม/ไร่ ผสมปุ๋ยสูตร 15-15-15 อัตรา 25 กิโลกรัม/ไร่ สำหรับในช่วงออกดอกและติดผลให้ใส่ปุ๋ยสูตร 13-13-21 อัตรา30-50 กิโลกรัม/ไร่ โดยทยอยใส่15 วัน/ครั้ง\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยวประมาณ 55-60 วัน หลังจากหยอดเมล็ดขึ้นอยู่กับพันธุ์และสภาพแวดล้อมที่เกี่ยวข้อง การเก็บเกี่ยวพิจารณาจากลักษณะฝักที่ตรงตามความต้องการของตลาด หรือจากอายุตั้งแต่วันผสมเกสรถึงเก็บเกี่ยวประมาณ10-15 วัน ควรเก็บในเวลาที่มีแดดอ่อน ๆ และนำเข้าในที่ร่มทันที","ส่วนกินฝัก/ผล","ถั่วฝักยาว","5.png");


        myDb.InsertDataVeg("ถั่วพู","Winged bean","Psophocarpus tetragonolobus (L.) DC.","เป็นพืชล้มลุกประเภทเถาเลี้อย ใบเป็นใบย่อย\n" +
                "ดอกคล้ายดอกแคร์แต่เล็กกว่า\n" +
                "ฝักเป็นรูปขอบขนานถึงรูปแถบ มีหน้าตัดเป็นรูปสีเหลี่ยม และแต่ละมุมของฝักจะมีปีกตามยาว ปีกมีลักษณะเป็นหยักแบบจักคล้ายฟันเลื่อย มีสีเขียว","1. ฝักอ่อนถั่วพูช่วยบำรุงร่างกาย  \n" +
                "2. หัวใต้ดินนำมาเผาหรือนึ่งกินช่วยบำรุงกำลัง\n" +
                "3.ใช้รากถั่วพูใช้ผสมกับสมุนไพรและน้ำดอกไม้ใช้เป็นยาชูกำลังก็ได้เช่นกัน","ระยะปลูก ระยะปลูก 1*1 เมตร \n" +
                "การเตรียมดิน เตรียมพื้นที่โดยการไถพรวนดิน ไถครั้งแรกตากดินไว้ 5 – 7 วันแล้วจึงไถดินครั้งที่สอง ขุดหลุมปลูก\n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "วิธีปลูก นำเมล็ดพันธุ์หยอดลงในหลุมๆ ละ 5เมล็ด เมื่อเมล็ดงอกจนมีใบจริงให้ถอนแยกให้เหลือหลุมละ 2 ต้นต่อหลุม เมื่อถั่วพูมีอายุ 15 วัน จึงปักค้างให้ถั่วพูเลื้อย รดน้ำวันละ 1 – 2 ครั้งต่อวัน\n"
                ,"การใส่ปุ๋ย ในช่วงแรกของการเจริญเติบโตใส่ปุ๋ยยูเรีย เมื่อถั่วพูเริ่มออกดอกให้ใส่ปุ๋ยสูตร 16 – 16 – 16 อัตรา 10 กิโลกรัมต่อไร่\n" +
                        "การเก็บเกี่ยว เริ่มเก็บเกี่ยวครั้งแรก เมื่อถั่วพูอายุประมาณ 2 เดือน เก็บเกี่ยววันเว้น 3 วัน นิยมเก็บฝักอ่อน เพราะราคาดีกว่าฝักแก่","ส่วนกินฝัก/ผล","ถั่วพู","6.png");


        myDb.InsertDataVeg("บวบเหลี่ยม","Angled loofah","Luffa acutangula (L.) Roxb.","เป็นพืชปีเดียว ลำต้นเลื้อยพัน ใบเป็นใบเดี่ยว ออกเรียงสลับ\n" +
                "ผลเป็นรูปทรงกระบอก มีขนาดสั้นกว่าบวบกลม แต่ผลจะมีเหลี่ยมเป็นสันขอบคมประมาณ 10 สัน ตามความยาวของผล","1. ผลเป็นยาเย็น ช่วยบำรุงร่างกาย ช่วยทำให้เลือดไหลเวียนดี\n" +
                "2. ผล เถา และทั้งต้นของบวบเหลี่ยมสามารถใช้เข้าในตำรับยาแก้ลม บำรุงหัวใจได้อีกด้วย ","ระยะปลูก ระยะหว่างาต้น75 เซนติเมตร ระหว่างแถง100 เซนติเมตร ไถดินให้ลึก30-40 เซนติเมตร \n" +
                "การเตรียมดิน ตากดินไว้1-2 อาทิตย์ แล้วย่อยดินให้ละเอียดร่วนโปร่งพร้อมที่จะปลูกหว่านปูนขาวในอัตรา100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอกอัตรา2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร15-15-15 อัตรา30-50 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตรกว้าง 12 เซนติเมตร\n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "การปลูก วิธีหยอดเมล็ดหลังจากเตรียมดินแล้วขุดหลุมตามระยะปลูกที่กำหนดไว้หลุมละประมาณ 3 เมล็ดกลบดินหนา 0.5 เซนติเมตร รดน้ำให้ชุ่มคลุมฟางแห้งเพื่อรักษาความชื้นเมื่อกล้าอายุ 15 วันหรือมีใบจริง 3-4 ใบ ให้ถอดแยกเหลือหลุมละ 2 ต้น การย้ายกล้านำกล้าบวบเหลี่ยมที่อายุ 15 วันหรือมี ใบจริง 3-4 ใบ มาปลูกตามหลุมที่กำหนดกลบดินและรดน้ำ เมื่อบวบเหลี่ยมอายุประมาณ 15-20 วันให้ทำค้างโดยใช้ค้างที่มีความยาวประมาณ2-2.5เมตรปักที่ข้างแปลงทุก ๆ 4 เมตร  ปักเชือกแล้วขึงตาข่ายให้ตึงเป็นแนวตั้งฉากกับแปลงให้เชือกมัดตาข่ายให้เป็นระยะติดกับเสาค้างสำหรับต้นบวบเหลี่ยมแต่ละต้น ควรใช้ไม้ไผ่รวกขนาดเล็กความยาว 30-50 เซนติเมตรปักข้างต้นเพื่อให้ลำต้นยึดเกาะแข็งแรงมากขึ้นและต้นไม้กระทบกระเทือนเมื่อมีลมแรง"
                ,"การใส่ปุ๋ย หลังย้ายปลูก 7-10 วัน ใส่ปุ๋ยสูตร 46-0-0 หรือ 25-7-7 อัตรา 30 กิโลกรัม/ไร่  เพื่อเร่งการเจริญเติบโตหลังปลูก 20 วัน ใส่ปุ๋ยสูตร 15-15-15 หรือ 16-16-16 อัตรา 40-50 กิโลกรัม/ไร่ และหลังปลูก 30 วัน ควรใส่ปุ๋ยสูตร 13-13-21 อัตรา 30-50 กิโลกรัม/ไร่\n" +
                        "การเก็บเกี่ยว อายุการเก็บเกี่ยว 40-45 วันหรือหลังจากดอกบาน 7-10 วัน สามารถเก็บเกี่ยวผลผลิตได้โดยเก็บที่มี ขนาดพอเหมาะไม้อ่อนหรือแก่เกินไปโดยการเก็บเกี่ยวให้มีขั้วบวบติดมากับผลด้วย","ส่วนกินฝัก/ผล","บวบเหลี่ยม","7.png");


        myDb.InsertDataVeg("พริกขี้หนู","Bird Chilli","Capsicum frutescens Linn.","มีลักษณะเป็นไม้ต้น ใบแบนและเรียบมัน\n" +
                "เป็นดอกสมบูรณ์เพศ คือมีเกสรตัวผู้และเกสรตัวเมียอยู่ภายในดอกเดียวกัน โดยปกติมักพบเป็นดอกเดี่ยว แต่อาจจะพบหลายดอกเกิดตรงจุด\n" +
                "มีทั้งผลเดี่ยวและผลกลุ่ม ผลพริกเป็นประเภท berry ที่มีลักษณะเป็นกระเปาะมีฐานขั้วผลสั้นและหนา โดยปกติผลอ่อนมักชี้ขึ้น เมื่อผลแก่พันธุ์ที่มีลักษณะขั้วผลอ่อน","1. ใช้ขับลม ขับปัสสาวะ แก้ท้องอืด\n" +
                "2. ผลดองสุราใช้ทาแก้ฟกช้ำดำเขียว ต้นมีรสเผ็ด ใช้ขับลม แก้กษัย รากใช้ฝนกับมะนาวแทรกเกลือ ","ระยะปลูก ระยะปลูกที่เหมาะสมสำหรับพริกที่ทรงพุ่มใหญ่ควรใช้ระยะระหว่างต้น 80เซนติเมตร ระยะห่างระหว่างแถว 100 เซนติเมตร\n" +
                "การเตรียมดิน การเตรียมแปลงเพาะ ทำเป็นแปลงขุดดินให้ลึกประมาณ 15- 20 เซนติเมตร ตากดินไว้ให้แห้ง 5-7 วัน โรยปุ๋ยคอกหรือปุ๋ยหมักให้มาก คลุกเคล้าให้ทั่ว ย่อยดินให้ละเอียด\n" +
                "การเตรียมกล้า การเพาะกล้า หลังเตรียมแปลงเพาะกล้าแล้ว ให้หว่านเมล็ดให้กระจายทั่วแปลง หรืออาจทำเป็นแถวห่างกันแถวละ 15 เซนติเมตร ทำร่องลึกประมาณ 1 เซนติเมตร แล้วโรยเมล็ดลงในร่องแล้วหว่านกลบด้วยปุ๋ยคอกหรือปุ๋ยหมักหรือดินละเอียด หนาประมาณ 0.5-1.0 เซนติเมตร รดน้ำให้ชุ่มและคลุมด้วยฟางแห้งหรือหญ้าแห้ง บาง ๆ หลังจากต้นกล้างอกได้ 15-20 วัน ให้ถอนแยกต้น ที่ไม้สมบูรณ์หรือต้นที่อ่อนแอออก พร้อมกันนี้พยายามจัดระยะกล้าให้ห่างกันประมาณ 10 เซนติเมตร ย้ายกล้าปลูกเมื่ออายุ 30-40 วัน\n" +
                "วิธีปลูก หลังจากเตรียมแปลงปลูก ขุดหลุมปลูกตามระยะที่กำหนด และต้นกล้าได้ขนาดดีแล้วก็ทำการปลูกได้ ต้นกล้าที่ย้ายปลูกได้ ควรเป็นต้นกล้าที่แข็งแรงมีอายุประมาณ 30-40 วัน สูงประมาณ 10-15 เซนติเมตร การถอนกล้าควรมีดินติดรากมาด้วยและทำอย่างระมัดระวังต้นกล้าที่ย้ายมาต้องรีบปลูกทันที การปลูกควรกดดินโคนต้นพริกให้แน่น และระวังอย่าให้รากลอยจะทำให้ต้นพริกโค่นล้มง่าย เพราะพริกมีรากแผ่กระจายอยู่ใกล้ผิวดินหลังจากปลูก แล้วรดน้ำให้ชุ่ม และควรทำเพิงบังแดดอย่าให้ต้นกล้าโดนแดดจัดในระยะเริ่มย้ายปลูกใหม่ ๆ เพราะต้นกล้าจะโตช้าหรือเฉาตาย"
                ,"การใส่ปุ๋ย ปุ๋ยที่แนะนำ คือปุ๋ยสูตร 15-1-15 หรือ 14-14-21 ใส่อัตรา 100 กิโลกรัม/ไร่ ทั้งนี้ขึ้นอยู่กับความสมบูรณ์ของดิน โดยแบ่งใส่เป็น 2 ครั้ง ครั้งแรกปริมาณครึ่งหนึ่งใส่รองพื้นพรวนกลบลงดิน ครั้งที่สองอีกครึ่งหนึ่งเมื่ออายุพริกได้ 30 วัน หลังย้ายปลูกแบบโรยข้างต้นแล้วพรวนกลบ\n" +
                        "การเก็บเกี่ยว พริกเป็นพืชที่มีอายุยืนและปลูกได้ผลดีตลอดปี อายุจากวันงอกจนถึงเก็บเกี่ยวผลผลิตสดครั้งแรกเมื่ออายุประมาณ 65-90 วัน การเก็บเกี่ยว ควรเก็บทุก ๆ 7 วัน ใช้วิธีเด็ดทีละผล โดยใช้เล็บจิกตรงรอยก้านผลต่อกับกิ่ง ซึ่งพริกจะได้ผลผลิตนาน 6 เดือน หรืออาจเป็นปีจนกว่าต้นจะเหี่ยว","ส่วนกินฝัก/ผล","พริกขี้หนู","8.png");


        myDb.InsertDataVeg("พริกไทย","Pepper","Piper nigrum L.","เป็นต้นไม้ที่มีอายุยืน จัดอยู่ในประเภทไม้เลื้อย\n" +
                "ใบใหญ่คล้ายใบโพ ดอกย่อยสีขาวหรือสีเหลืองอ่อน 50-150 ดอกต่อช่อ\n" +
                "ผลทรงกลมแบบเมล็ดเดียวแข็ง","1. ช่วยป้องกันและลดความเสี่ยงของการโรคมะเร็ง  ช่วยลดน้ำหนักและไขมันในเส้นเลือด\n" +
                " 2. ช่วยลดขนาดของเซลล์ไขมัน  ","ระยะปลูก พันธุ์ซาราวัค ใช้ระยะ 2 x 2 เมตร พันธุ์ซีลอน ใช้ระยะปลูก 2.25 x 2.25 หรือ 2.25 x 2.5 เมตร จำนวนต้นต่อไร่ 400 ค้าง ค้างละ 2 ต้น รวม 800 ต้น / ไร่\n" +
                "การเตรียมดิน แปลงปลูกจะต้องเป็นพื้นที่ที่มีการระบายน้ำได้ดี ปรับพื้นที่ไม่ให้มีสภาพน้ำขัง ไม่ชื้นแฉะหรือเป็นแอ่งน้ำ ไถพรวนดินลึก 40-60 เซนติเมตรปรับปรุงดินด้วยอินทรียวัตถุ โดยการใส่ปุ๋ยคอกหรือปุ๋ยหมัก 2-3 ตันต่อไร่ เพื่อให้ดินสามารถดูดซับธาตุอาหารได้ดี หากดินเป็นกรดควรปรับด้วยปูนขาวหรือปูนโดโลไมด์ เพื่อให้ความเป็นกรดน้อยลง ตากดิน 15 วัน ยกแปลงเป็นลอนลูกฟูก\n" +
                "การเตรียมกล้า พันธุ์ซาราวัค เหมาะสมสำหรับพริกไทยแก่ พันธุ์ซีลอน เหมาะสมสำหรับพริกไทยอ่อน\n" +
                "วิธีปลูก ใช้ค้างไม้แก่นหรือค้างปูนซีเมนต์ ขนาด 4 เมตร ฝังลึก 50 – 60 เซนติเมตร กลบดินให้แน่น ค้างละ 1 หลุม ห่างจากโคนค้าง 15 เซนติเมตร ขุดหลุมขนาด 40 x 60 เซนติเมตร ลึก 40 เซนติเมตร ผสมดินกับปุ๋ยอินทรีย์ อัตรา 1 : 1 แล้วใส่ในหลุมประมาณครึ่งหลุม น้ากิ่งพันธุ์ที่เตรียมไว้ไปปลูกหลุมละ 2 กิ่ง ให้ปลายยอดเอนเข้าหาค้าง หันด้านที่มีราก (ตีนตุ๊กแก) ออกด้านนอกค้าง กลบดินให้แน่นรดน้ำให้ชุ่ม"
                ,"การใส่ปุ๋ย ใส่ปุ๋ยอินทรีย์หรือปุ๋ยคอกปุ๋ยหมัก อย่างน้อยปีละ 1 ครั้ง ปุ๋ยดังกล่าวจะช่วยปรับสภาพความเป็นกรด่างของดินให้เหมาะกับการเจริญเติบโตของพริกไทยและช่วยท้าให้ดินโปร่งมีความสามารถดูดซับความชื้นและเพิ่มแร่ธาตุ จ้าเป็นต้องใช้ควบคู่กับปุ๋ยเคมี สูตร 15-15-15, 8-24-24 และ 12-12-17+Mg .ให้พิจารณาเลือกใส่สูตรใดสูตรหนึ่งตามความเหมาะสมดังนี้ ปีที่ 1 ใส่ปุ๋ยเคมี ประมาณ 400-500 กรัมต่อค้าง \n" +
                        "การเก็บเกี่ยว พริกไทยอ่อนเก็บเกี่ยวหลังติดผล 3 – 4 เดือน พริกไทยดำ เก็บเกี่ยวผลแก่ที่ยังเขียวอยู่เมื่อผลสีเขียว แก่จัดแต่ไม่สุก ระยะเวลาหลังติดผล 6 – 8 เดือนพริกไทยขาว ต้องเก็บเกี่ยวที่แก่จัด และผลเริ่มสุกเป็นสีแดงที่โคนช่อ 3-4","ส่วนกินฝัก/ผล","พริกไทย","9.png");


        myDb.InsertDataVeg("ฟักเขียว","Benincasa hispida Cogn.","Chinese Watermelon","ลำต้นสีเขียวมีขนขึ้นปกคลุมอยู่ทั่วลำต้น แตกกิ่งก้านสาขามากมาย\n" +
                "ใบมีลักษณะเป็นหยักคล้ายฝ่ามือขอบใบแยกออกเป็น 5–7 แฉก\n" +
                "มีดอกเดี่ยวสีเหลือง ดอกเพศผู้มีลักษณะเป็นหลอดยาว 5–10 เซนติเมตร เป็นรูปกลมยาวกว้างประมาณ 20–30 เซนติเมตร ยาว 30–60 เซนติเมตร เปลือกแข็งสีเขียวเนื้อในสีขาว เนื้อแน่น ฉ่ำน้ำ\n" +
                "มีเมล็ดอยู่ภายในจำนวนมากสีขาวออกเหลือง","1. ช่วยป้องกันและลดความเสี่ยงของการโรคมะเร็ง  ช่วยลดน้ำหนักและไขมันในเส้นเลือด\n" +
                "2. ช่วยลดขนาดของเซลล์ไขมัน ","ระยะปลูก ระหว่างแถว 1- 1.50 เมตร ระหว่างต้น 2-2.50 เมตร เป็นพืชที่ต้องการพื้นที่ปลูกมาก\n" +
                "การเตรียมดิน ไถดินลึกประมาณ 25-30 ซนติเมตร ตากดินทิ้งไว้ 1-2 อาทิตย์ แล้วย่อยดินให้ละเอียด หว่านปูนขาวประมาณ 100-300 กิโลกรัม ใส่ปุ๋ยคอกหรือปุ๋ยหมัก อัตรา 2,000-2,500 กิโลกรัม ใส่ปุ๋ยสูตร 15-15-15 อัตรา 30-50 กิโลกรัม / ไร่ คลุกเคล้าให้เข้ากัน\n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น \n" +
                "วิธีปลูก หลังเตรียมแปลงปลูกและขุดหลุมปลูกตามระยะที่กำหนดแล้ว หยอดเมล็ด 2-3 เมล็ด/หลุมลึกประมาณ 3-5 เซนติเมตร แล้วกลบหลุมหรือคลุมด้วยฟางแห้ง เพื่อรักษาความชื้นของดิน และรดน้ำสม่ำเสมอทุกวัน อายุ 10-14 วัน หรือมีใบจริง 2-4 ใบ ควรถอนแยกเหลือ 2 ต้นต่อหลุม เมื่อฟักเริ่มเลื้อยหรือมีอายุประมาณ 15-20 วัน ควรทำค้างหรือร้านเพื่อให้เลื้อยเกาะขึ้นไป ปักไม้ค้าง ยาว 2-2.50 เมตร แล้วเอนปลายเข้าหากันจากนั้นใช้ไม้ค้างพาดขวางประมาณ 2 -3 ช่วง ๆละ 40-50 เซนติเมตร หรือทำเป็นค้างผูกเป็นร้านสูงประมาณ 1.5-2.0 เมตร เพื่อให้เหมาะและสะดวกต่อการทำงาน นอกจากนี้อาจใช้ค้างธรรมชาติที่มีอยู่แล้วเช่นไม้พุ่มเล็ก ๆรั้วบ้าน ซึ่งเหมาะสำหรับการปลูกผักสวนครัว"
                ,"การใส่ปุ๋ย อายุ 7-10 วัน หลังงอก ใส่ปุ๋ย สูตร 46-0-0 อัตรา 30-50 กิโลกรัม/ไร่ สำหรับในช่วงออกดอกใส่ปุ๋ยสูตร 15-15-15 และช่วงติดผลใส่ปุ๋ยสูตร 13–13- 21 หรือสูตรใกล้เคียง อัตรา 30–50 กิโลกรัม /ไร่ โดยทยอยใส่\n" +
                        "การเก็บเกี่ยว หลังหยอดเมล็ดจนถึงอายุการเก็บเกี่ยว 60 - 70 วัน หรือสังเกตได้จากว่า เริ่มมีไขสีขาวจับผลโดยใช้มีดคมๆตัดที่ขั้วของผล การเก็บควรเหลือขั้วติดไว้ด้วย เพื่อช่วยให้เก็บรักษาได้นานขึ้น","ส่วนกินฝัก/ผล","ฟักเขียว","10.png");


        myDb.InsertDataVeg("ฟักทอง","Pumpkin","Cucurbita moschata Duchesne","เป็นไม้เถาเลื้อยไปตามดิน ใบเดี่ยวรูปห้าเหลี่ยม มีขนทั้งสองด้าน\n" +
                "ดอกสีเหลืองรูปกระดิ่ง\n" +
                "ผลฟักทองมีด้วยกันหลายลักษณะ บางครั้งเป็นผลเกือบกลมก็มี แต่โดยทั่วไปเป็นรูปทรงกลมแป้น ผิวขรุขระเล็กน้อย เมื่อยังดิบเนื้อค่อนข้างแข็ง","1. ฟักทองมีสารต่อต้านอนุมูลอิสระที่มีส่วนช่วยในการชะลอวัยและความแก่ชรา\n" +
                "2. ช่วยฟื้นบำรุงสุขภาพผิวให้เปล่งปลั่งสดใสและช่วยปกป้องผิวไม่ให้เหี่ยวย่น","ระยะปลูก ระหว่างแถว1-1.5 เมตร ระหว่างต้น2-2.5 เมตร เป็นพืชที่ต้องการพื้นที่ปลูกมาก\n" +
                "การเตรียมดิน ไถดินลุกประมาณ25-30 เซนติเมตร ตากดินทิ้งไว้1-2 อาทิตย์ แล้วย่อยดินให้ละเอียด หว่านปูนขาวประมาณ100-300 กิโลกรัม ใส่ปุ๋ยคอกหรือปุ๋ยหมัก อัตรา2,000-2,500 กิโลกรัม ใส่ปุ๋ยสูตร15-15-15 อัตรา 30-50 กิโลกรัม/ไร่ คลุกเคล้าให้เข้ากัน\n" +
                "การเตรียมกล้า เตรียมถาดเพราะกล้าและดินผสม(ดินที่ร่วนแล้ว 3 ส่วนปุ๋ยคอก 1 ส่วนทรายหรือแกลบ1 ส่วน)  รดน้ำและทยอยเมล็ดลงในถาดหลุม หลุมละ1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "วิธีปลูก หลังเตรียมแปลงปลูกและขุดหลุมปลูกตามระยะที่กำหนดแล้วหยอดเมล็ด 2-3 เมล็ด/หลุมลึกประมาณ 3-5 เซนติเมตร แล้วกลบหลุมปลูกด้วยดินหรือคลุม   ด้วยฟางแห้งเพื่อรักษาความชื้นของดิน และรดน้ำชุ่มอายุ 5-7 วันเมล็ดงอกควรถอนแยกเหลือ2 ต้นต่อหลุม","การใส่ปุ๋ย อายุ7-10 วัน หลังงอก ใส่ปุ๋ยสูตร46-0-0 อัตรา30-50 กิโลกรัม/ไร่ สำหรับในช่วงออกดอก ใส่ปุ๋ยสูตร15-15-15 และติดผลใส่ปุ๋ยสูตร13-13-21 หรือสูตรใกล้เคียง อัตรา30-50 กิโลกรัม/ไร่ โดยทยอยใส่\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยว 80-90 วันหรือสังเกตสีเปลือกสีกลมกลืนเป็นสีเดียวกันดูนวลขึ้นเต็มผลการเก็บควรเหลือขั้วติดไว้ด้วยเพื่อช่วยให้เก็บรักษาได้นานขึ้น","ส่วนกินฝัก/ผล","ฟักทอง","11.png");


        myDb.InsertDataVeg("มะเขือเทศ","Tomato","Lycopersicon esculentum Mill.","เป็นพืชล้มลุกอายุเพียง 1 ปี ใบเป็นใบประกอบ ออกสลับกัน ใบย่อยมีขนาดไม่เท่ากัน บางใบเล็กรียาว บางใบกลมใหญ่ ปลายใบแหลม ดอกเป็นช่อ ออกบริเวณซอกใบ ก้านช่อดอกจะยาว แตกกิ่งช่อดอกตรงปลาย ดอกมะเขือเทศเป็นดอกสมบูรณ์เพศ","1. ช่วยให้ร่างกายสามารถต่อสู้กับโรคหอบหืดได้มากถึง 45%\n" +
                " 2. ช่วยป้องกันโรคสมองเสื่อมหรืออัลไซเมอร์","ระยะปลูก ระหว่างต้น 80 เซนติเมตร ระหว่างแถว 100 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึก 30-40 เซนติเมตร ตากดินไว้ 7-10 วัน ย่อยดินให้ละเอียดหว่านปูนขาวในอัตรา 100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอกอัตรา 2,000 กิโลกรัม/ไร่ และปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าในแปลงยกแปลงสูงประมาณ 30 เซนติเมตร กว้าง 100 เซนติเมตร รดน้ำและคลุมด้วยถุงพลาสติก เพื่อรักษาความชื้นและป้องกันวัชพืช ควรเตรียมดินให้เสร็จก่อนปลูก 2-3 อาทิตย์\n" +
                "การเตรียมกล้า เตรียมถาดเพาะกล้าและดินผสม (ดินที่ร่อนแล้ว 3 ส่วน ปุ๋ยคอก 1 ส่วนทรายหรือแกลบ 1 ส่วน) ใส่ดินผสมลงในถาดเพาะกล้า รดน้ำ แล้วจึงหยอดเมล็ดลงในถาดเพาะกล้าหลุม หลุมละ 1 เมล็ด รดน้ำรักษาความชุมชื้นอย่าให้แฉะเกินไป\n" +
                "วิธีปลูก ปลูกแถวคู่เจาะพลาสติกเป็นหลุมตามระยะที่กำหนด ขุดหลุม แล้วนำกล้ามะเขือเทศที่มีอายุ 30 วัน หรือมีใบจริง 2-3 ใบ มาปลูกตามหลุม กลบดินและรดน้ำ ระวังอย่าจับบริเวณโคนต้นกล้า","การใส่ปุ๋ย ควรใส่ปุ๋ยสูตร 13-13-21 ในอัตรา 100 กิโลกรัม/ไร่ ครั้งแรกหลังจากย้ายกล้าปลูก 7วัน ครั้งที่สองหลังจากใส่ครั้งที่หนึ่ง 15 วัน ครั้งที่สามหลังจากใส่ครั้งที่สอง 20 วัน\n" +
                "การเก็บเกี่ยว มะเขือเทศสามารถเก็บผลผลิตได้เมื่ออายุประมาณ 70-90 วัน นับตั้งแต่เพาะกล้าและสามารถเก็บเกี่ยวผลผลิตได้นานประมาณ 4-5 เดือนสำหรับมะเขือเทศพันธ์เลื้อย เช่นพันธุ์สีดา แต่สำหรับพันธุ์พุ่ม สามารถเก็บผลผลิตได้ 6-7 ครั้งซึ่งส่วนใหญ่เป็นพันธุ์ที่ปลูกสำหรับแปรรูปหรือเข้าโรงงานอุตสาหกรรม","ส่วนกินฝัก/ผล","มะเขือเทศ","12.png");


        myDb.InsertDataVeg("มะเขือเปราะ","Thai Eggplant","Solanum virginianum L.","เป็นไม้พุ่ม ที่มีความสูงของต้นประมาณ 2-4 ฟุต เป็นพืชใบเลี้ยงคู่\n" +
                "แตกออกเป็นใบเดี่ยวสลับกันบนกิ่ง มีก้านใบทรงกลม\n" +
                "ดอกมีขนาดใหญ่ เป็นสีม่วงหรือสีขาว\n" +
                "ผลมีรูปร่างกลมแบนหรือรูปไข่ อาจมีสีขาว เขียว เหลือง ม่วง ขึ้นอยู่กับพันธุ์ ผลเมื่อแก่มีสีเหลือง เนื้อในผลสีเขียวเป็นเมือก มีรสขื่น","1. ผลใช้เป็นยาลดไข้ ผลตากแห้งนำมาบดเป็นผงผสมกับน้ำผึ้งใช้ปรุงเป็นยาแก้ไอ\n" +
                "2. ผลตากแห้งนำมาบดเป็นผงผสมกับน้ำผึ้งใช้ปรุงเป็นยาแก้ไอ ","ระยะปลูก ระหว่างต้น 80 เซนติเมตร ระหว่างแถว 100 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึก 30-40 เซนติเมตร ตากดินไว้ 7- 10 วัน ย่อยดินให้ละเอียดหว่านปูนขาว ในอัตรา 100-200 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ และใส่ปุ๋ย สูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วยกแปลง ให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า ใส่ดินผสมในถาดเพาะกล้า ( ดินที่ร่อนแล้ว 3 ส่วน ปุ๋ยคอก 1 ส่วนทรายหรือแกลบ 1 ส่วน) รดน้ำและหยอดเมล็ดลงในถาดหลุม หลุมละ 1 เมล็ด รดน้ำเช้า – เย็น\n" +
                "วิธีปลูก ขุดหลุมปลูกลึกประมาณ 10-20 เซนติเมตร นำกล้ามะเขือเปราะที่มีอายุ15 วัน หรือมีใบจริง 3-4 ใบ มาปลูกตามหลุมที่กำหนดกลบดินและรดน้ำ","การใส่ปุ๋ย หลังย้ายปลูก 7-10 วัน หรือใส่ปุ๋ยสูตร 46-0-0 อัตรา 30 กิโลกรัม/ไร่เพื่อเร่งการเจริญเติบโต ใส่ปุ๋ยสูตร 13-13- 21 หรือ 8-24-24 อัตรา 50-100 กิโลกรัม/ไร่ โดยทยอยแบ่งใส่ในช่วงออกดอกติดผล ทุก 20 วัน\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยว 65-70 วัน หรือหลังดอกบาน 7-10 วัน จะสามารถเก็บเกี่ยวผลผลิตได้โดยเก็บผลที่มีขนาดพอเหมาะไม่อ่อนหรือแก่เกินไป โดยการเก็บเกี่ยวให้ขั้วมะเขือติดมากับผลด้วย","ส่วนกินฝัก/ผล","มะเขือเปราะ","13.png");


        myDb.InsertDataVeg("มะเขือยาวหรือมะเขือม่วง","Eggplant","Solanum melongena L.","ต้นเป็นไม้ล้มลุก ลำต้นมีความสูงประมาณ 0.5-1 เมตร\n" +
                "เป็นพืชใบเลี้ยงคู่ แตกออกเป็นใบเดี่ยวๆเรียงสลับกันบนกิ่ง มีก้านใบยาวประมาณ 5-8 เซนติเมตร แผ่นใบมีขนาดใหญ่\n" +
                "เป็นดอกสมบูรณ์เพศ ออกได้ทั้งแบบดอกเดี่ยวหรือดอกช่อ ขึ้นอยู่กับสายพันธุ์ ผลมีลักษณะกลมรียาวทรงหยดน้ำ\n" +
                "ผิวผลเรียบเป็นสีม่วงหรือสีเขียว ขนาดของผลขึ้นอยู่กับสายพันธุ์ ลักษณะของผลอาจจะกลมเป็นรูปไข่หรือกลมยาว","1. มีสารช่วยต่อต้านอนุมูลอิสระ\n" +
                "2.ช่วยยับยั้งการดูดซึมของคอเลสเตอรอลผ่านหนังลำไส้ได้","ระยะปลูก ระหว่างต้น 80 เซนติเมตร ระหว่างแถว 100 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึก 30-40 เซนติเมตร ตากดินไว้ 7-10 วัน ย่อยดินให้ละเอียดหว่านปูนขาว ในอัตรา 100-200 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000กิโลกรัม/ไร่ และใส่ปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าในแปลงยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 10 เซนติเมตร\n" +
                "การเตรียมกล้า ใส่ดินผสมในถาดเพาะกล้า(ดินที่ร่อนแล้ว 3 ส่วน ทรายหรือแกลบ 1 ส่วน)รดน้ำและหยอดเมล็ดลงในถาดหลุมหลุมละ 1 เมล็ด รดน้ำเช้า- เย็น\n" +
                "วิธีปลูก ขุดหลุมปลูกลึกประมาณ 10-20 เซนติเมตร นำกล้ามะเขือยาวมีอายุ 15 วัน หรือมีใบจริง 3-4 ใบ มาปลูกตามหลุมที่กำหนดกลบดินและรดน้ำ","การใส่ปุ๋ย หลังย้ายปลูก 7-10 วันใส่ปุ๋ยสูตร 46-0-0 อัตรา 30 กิโลกรัม/ไร่ เพื่อเร่งการเจริญเติบโตใส่ปุ๋ยสูตร 13-13-21 หรือ 8- 24-24 อัตรา 50-100 กิโลกรัม/ไร่ โดยทยอยแบ่งใส่ในช่วงออกดอกติดผล ทุก 20 วัน\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยว 65-70 วัน หรือหลังดอกบาน 7-10 วัน จะสามารถเก็บเกี่ยวผลผลิตได้โดยเก็บผลที่มีขนาดพอเหมาะไม่อ่อนหรือแก่เกินไป โดยการเก็บเกี่ยวให้ขั้วมะเขือติดมากับผลด้วย","ส่วนกินฝัก/ผล","มะเขือยาวหรือมะเขือม่วง","14.png");


        myDb.InsertDataVeg("มะระจีน","Bitter melon","Momordica charantia L.","เป็นไม้เถา ใบเป็นใบเดี่ยว มีสีเขียวมีขนอ่อน ดอกสีเหลือง\n" +
                "ผลมีลักษณะทรงยาวรี เปลือกบาง ผิวขรุขระมีร่องลึกตามยาว ผลใหญ่เนื้อหนาผลดิบจะมีสีเขียวอ่อน ใช้รับประทาน เมื่อผลสุกจะมีสีแดง รับประทานไม่ได้ ภายในผลจะมีหลายเมล็ด มีเนื้อฉ่ำน้ำ มีรสชาติขม","1. แก้เบาหวาน ลดน้ำตาลในเลือด\n" +
                "2. ผลดิบ-กินแก้โรคตับอักเสบ ปวดหัวเข่า ม้าม อักเสบ\n" +
                "3. ผลสุก-ใช้คั้นน้ำทาหน้าแก้สิว","ระยะปลูก ระยะปลูกระหว่างต้น50-75 เซนติเมตร ระหว่างแถว100-120 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินลึกประมาณ30-40 เซนติเมตร ตากดินทิ้งไว้7-10 วัน ย่อยดินให้ละเอียด หว่านปูนขาวในอัตรา 100-200 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอกอัตรา 2,000 กิโลกรัม/ไร่ และปุ๋ยสูตร15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงสูงประมาณ 30 เซนติเมตรกว้าง 120 เซนติเมตร รดน้ำและคลุมด้วยพลาสติก เพื่อรักษาความชื้นและป้องกันวัชพืช\n" +
                "การเตรียมกล้า ทำการเพาะกล้าซึ่งประกอบด้วย ทราย ปุ๋ยหมักหรือปุ๋ยคอกที่สลายตัวดีและดินย่อยละเอียดอย่างละเท่า ๆ กัน เจาะหลุม หยอดเมล็ด กลบด้วยดินบาง ๆ รดน้ำ\n" +
                "วิธีปลูก ย้ายกล้าปลูกเมื่อต้นกล้ามีใบจริง 4-5 ใบ หรืออายุ 15-20 วันจึงย้ายลงปลูกในแปลง ปักไม้ค้างผูกเป็นร้างสูงประมาณ 1.5 -2 เมตร ขึงด้วยตาข่ายพลาสติกห่าง ๆ","การใส่ปุ๋ย หลังย้ายปลูก7-10 วัน ใส่ปุ๋ยสูตร46-0-0 อัตรา30 กิโลกรัม/ไร่ เพื่อเร่งการเจริญเติบโตใส่ปุ๋ยสูตร 13-13-21 อัตรา 30-50 กิโลกรัม/ไร่ โดยทยอยแบ่งใส่ในช่วงออกดอก- ติดผล\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยวของมะระจีนประมาณ45-50 วัน  หลังจากหยอดเมล็ดทยอยเก็บผลผลิตที่ได้ขนาดที่เหมาะสมทุกวันหรือวันเว้นวัน สามารถเก็บผลผลิตได้ 17-20 ครั้ง อายุการเก็บเกี่ยวครั้งสุดท้าย85-90 วัน","ส่วนกินฝัก/ผล","มะระจีน","15.png");


        myDb.InsertDataVeg("กะเพรา","Holy basil","Ocimum tenuiflorum L.","เป็นไม้ล้มลุก ก้านเป็นขน ก้านใบยาว รูปใบเรียว โคนใบรูดในลักษณะเรียวปลายมนรอบขอบใบเป็นหยัก พื้นใบด้านหน้าสีเขียว หรือแดงแก่กว่าด้านหลัง\n" +
                "ดอกย่อยมีขนาดเล็ก รูปคล้ายระฆัง กลีบดอกมีทั้งชนิดสีขาวลายม่วงแดงและสีขาว","ช่วยทำให้ร่างกายอบอุ่นและป้องกันอาการหวัดได้ กะเพราเป็นส่วนประกอบของยาสมุนไพรหลายชนิด ","ระยะปลูก ระหว่างต้น 40 เซนติเมตร ระหว่างแถว 40 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30-40 เซนติเมตร ตากดินไว้ 1-2 อาทิตย์ ย่อยดินให้ละเอียด หว่านปูนขาว ในอัตรา 100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมัก หรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูตรประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า ไม่ต้องเพาะกล้า ปักชำสามารถปลูกได้เลย\n" +
                "วิธีปลูก กะเพราสามารถปลูกได้โดยใช้กิ่งชำเป็นต้นกล้าแล้วย้ายปลูกตามระยะห่างที่กำหนด","การใส่ปุ๋ย  สูตร 15-15-15 ในอัตรา 30-50 กิโลกรัม/ไร่ หลังเก็บเกี่ยวทุกครั้ง\n" +
                "การเก็บเกี่ยว ใช้มีดคม ๆ เก็บเกี่ยวโดยตัดแต่งกิ่งก้านที่แก่ เจริญเติบโตเต็มที่แล้วซึ่งในไม่ช้ากะเพราจะแตกกิ่งต้น ออกมาเช่นเดิม (อายุเก็บเกี่ยว 40-45 วัน) สามารถเก็บเกี่ยวได้หลายครั้ง ในระยะที่ไม่ได้เก็บเกี่ยวผลผลิตควรมีการตัดดอกทิ้งเพื่อเรง่ การเจริญเติบโตทางใบ","ส่วนกินใบ/ลำต้น","กะเพรา","16.png");


        myDb.InsertDataVeg("กะหล่ำปลี","Cabbage","Brassica oleracea var. capitata L.","ใบกะหล่ำปลีมีหลายสีขึ้นอยู่กับสายพันธุ์ เป็นส่วนที่นำมาบริโภค ใบจะแตกออกด้านข้างลำต้น เรียงวนรอบลำต้น ผิวใบมีลักษณะเรียบ แต่เป็นลูกคลื่น","1.บำรุงกระดูกและฟัน\n" +
                "2.ช่วยย่อยอาหาร","ระยะปลูก ระยะปลูกระหว่างต้น 50 – 70 เซนติเมตร ระหว่างแถว 100 – 120 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30 - 40 เซนติเมตรตากดินไว้ 1 - 2 อาทิตย์แล้วย่อยดินให้ละเอียดหว่านปูนขาว ในอัตรา 100 - 300 กิโลกรัม/ไร่ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15 - 15 - 15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า การเพาะกล้า หลังจากเตรียมแปลงเพาะกล้าแล้วให้หว่านเมล็ดกะหล่ำปลีให้กระจายทั่วแปลง หรืออาจจะใช้ทำเป็นแถวห่างกันแถวละ 15 เซนติเมตรทำร่องลึกประมาณ 1 เซนติเมตร แล้วโรยเมล็ดลงในร่องแล้วหว่านกลบด้วยปุ๋ยคอกหรือปุ๋ยหมักหรือดินละเอียด หนาประมาณ 0.5 – 1.0 เซนติเมตร รดน้ำให้ชุ่มแล้วคลุมด้วยฟางแห้ง หรือหญ้าแห้งบาง ๆ หลังจากต้นกล้างอกได้ 15 – 20 วัน ให้ถอนแยกต้นที่ไม่สมบูรณ์หรือต้นที่อ่อนแอออก พร้อมกันนี้พยายามจัดระยะกล้า ให้ห่างกันประมาณ 10 เซนติเมตรย้ายปลูกเมื่ออายุ 25 - 30 วัน\n" +
                "วิธีปลูก หลังจากเตรียมแปลงปลูก และขุดหลุมปลูกตามระยะที่กำหนดแล้ว จึงย้ายกล้ามาปลูก ต้นกล้าที่ย้ายปลูกควรแข็งแรงมีอายุประมาณ 25 - 30 วันการถอนกล้าควรมีดินติดรากมาด้วย และทำอย่างระมัดระวัง ต้นกล้าที่ย้ายมาต้องรีบปลูกทันทีการปลูกควรกดดินโคนต้นให้แน่น หลังจากปลูกแล้วรดน้ำให้ชุ่ม","การใส่ปุ๋ย กะหล่ำปลี เป็นผักที่ต้องการปุ๋ยมาก ควรใส่ปุ๋ย 46 - 0 - 0 อัตรา 30 กิโลกรัม/ไร่ หลังย้ายปลูก7 - 10 วัน หลังปลูก 20 วัน ควรใส่ปุ๋ย 15 - 15 - 15 อัตรา 50 กิโลกรัม /ไร่ และหลังปลูก 40 วัน (ก่อนกะหล่ำปลีเข้าหัว)ควรใส่ปุ๋ยสูตร 13 - 13 - 21 หรือ 14 - 14 - 21 อัตรา 50กิโลกรัม/ไร่ และควรมีการฉีดพ่นปุ๋ยที่มีธาตุโบรอนผสมหรือพ่นธาตุโบรอนอย่างเดียวในอัตรา 10 - 12 กรัม/น้ำ 20 ลิตรเป็นครั้งคราว\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยวของกะหล่ำปลีขึ้นอยู่กับลักษณะของแต่ละพันธุ์ พันธุ์เบาประมาณ 50 – 60 วันส่วนพันธุ์หนักมีอายุประมาณ 120 วัน ควรเก็บหัวที่ห่อแน่น และมีขนาดพอเหมาะ โดยกะหล่ำปลีจะมีน้ำหนักประมาณ 1 - 2 กิโลกรัม/ต้น","ส่วนกินใบ/ลำต้น","กะหล่ำปลี","17.png");


        myDb.InsertDataVeg("กุยช่าย","Garlic chives","Allium tuberosum Rottler ex Spreng.","เป็นไม้ล้มลุก ใบแบนเรียงสลับรูปขอบขนาน\n" +
                "ดอกจะมีสีขาวจะออกเป็นกระจุกแถวๆซอกใบ โดยดอกจะมีกลีบดอกอยู่ 6กลีบ","1.ช่วยบำรุงกระดูก เนื่องจากใบกุยช่ายมีธาตุฟอสฟอรัสสูง \n" +
                "2.ช่วยป้องกันมะเร็ง ลดความเสี่ยงของการเกิดโรคมะเร็ง","ระยะปลูก ระยะปลูก 12 – 20 ต้นต่อ ตารางเมตรหรือใช้ระยะปลูก30 x 30 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30 - 40 เซนติเมตรตากดินไว้ 1 - 2 อาทิตย์\n" +
                "การเตรียมกล้า อายุกล้า 55 – 60 วัน สามารถนำไปปลูกได้\n" +
                "วิธีปลูก ปลูกโดยการแยกกอ ใช้ต้นแม่พันธุ์อายุ 6 เดือนขึ้นไป ขุดและแยกกอปลูก ก่อนปลูกควรตัดใบออกไปบ้าง เพื่อลดการคายน้ำ ตัดรากให้เหลือยาว 1 – 2 เซนติเมตร ปลูก 3 – 4 ต้นต่อหลุม การปลูกกุยช่ายแต่ละแปลงใช้เวลา 3 ปี หลังจากนั้นควรทำการแยกกอและเตรียมแปลงปลูกใหม่","การใส่ปุ๋ย หลังเตรียมดินควร ใส่ปุ๋ยหมัก ปุ๋ยคอกอัตรา 2 กิโลกรัมต่อตารางเมตร\n" +
                "การเก็บเกี่ยว กุยช่ายเขียว สามารถเก็บเกี่ยว 3 – 9 ครั้งต่อปี ขึ้นอยู่กับพันธุ์สภาพแวดล้อมและการดูแลรักษาระยะเวลาเก็บเกี่ยวที่เหมาะสมคือเดือนตุลาคม – มีนาคม กุยช่ายขาว เก็บเกี่ยวหลังจากใช้กระถางครอบหรือคลุมแปลงประมาณ 2 อาทิตย์ เก็บเกี่ยวเมื่อใบมรความยาว 20 เซนติเมตรตัดโคนใบชิดดิน ล้างด้วยน้ำเย็น ตัดแต่งส่วนที่ถูกทำลายโดยโรคแมลง หรือแผลที่เกิดจากการขนส่ง และเศษวัชพืชอื่นที่ปลอมปนเก็บไว้ในที่ร่มป้องกันแสงอาทิตย์ในระหว่างเก็บรักษาและขนส่ง","ส่วนกินใบ/ลำต้น","กุยช่าย","18.png");


        myDb.InsertDataVeg("ขึ้นฉ่าย","Celery","Apium graveolens L.","ใบย่อยบนก้าน ออกตรงข้ามกัน มีลักษณะทรงกลมรี ใบเว้าลึกเป็นแฉก ขอบใบมีรอยหยักรอบนอก มีสามใบย่อยอยู่บนก้าน มีสีเขียว มีกลิ่นหอมเฉพาะตัว\n" +
                "ออกเป็นช่อ ก้านช่อดอกยาว มีดอกย่อยเล็ก ๆ มีลักษณะแบบซี่ร่ม กลีบดอกมีสีขาว มีก้านดอกย่อยเล็ก ๆ","1.คะน้ามีวิตามินหลายชนิด ช่วยลดความเสี่ยงต่อการเกิด มะเร็งกระเพาะอาหาร มะเร็งลำไส้ มะเร็งปอด ","ระยะปลูก นิยมใช้หว่านเมล็ดลงบนแปลงปลูก โดยใช้เมล็ดพันธุ์ 0.5-1 กิโลกรัม /ไร่\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 20-25 ซนติเมตรตากดินไว้ 1-2 อาทิตย์ แล้วย่อยดินให้ละเอียดหว่านปูนขาวในอัตรา 100 -300 กิโลกรัม/ไร่ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ใส่ปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม / ไร่คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร คลุมฟางบาง ๆแล้วรดน้ำให้ทั่วแปลงปลูก หว่านเมล็ดขึ้นฉ่ายให้ผสมทราย อัตรา 1: 10 (เมล็ดขึ้นฉ่าย : ทราย )เพราะเมล็ดเล็กและเบา ทำให้การหว่านไม่สม่ำเสมอ\n" +
                "การเตรียมกล้า นิยมใช้หว่านเมล็ดลงบนแปลงปลูก ทำให้ไม่ต้องเพราะกล้า\n" +
                "วิธีปลูก รดน้ำแปลงปลูกให้ชุ่ม แล้วนำเมล็ดหว่านให้กระจายทั่วทั้งแปลง อายุขึ้นฉ่าย 20 —30 วันให้ถอนแยก ให้ห่างประมาณ 5 —10 เซนติเมตร","การใส่ปุ๋ย ใส่ปุ๋ยสูตร 46-0-0หรือ 25-7-7อัตรา 50 กิโลกรัม/ไร่ แบ่งใส่ 2 ครั้ง หลังหว่านเมล็ด7 วัน และ 15 วัน หลังถอนแยกใส่ปุ๋ยสูตร15-15-15และอายุ 30-35 วัน ให้หว่านปุ๋ยสูตร 15-15-15 อีกครั้งจนกว่าสามารถเก็บเกี่ยวผลผลิตได้\n" +
                "การเก็บเกี่ยว หลังจากหว่านเมล็ดขึ้นฉ่ายลงแปลง อายุการเก็บเกี่ยว 40-45 วัน ทยอยเก็บผลผลิต โดยเก็บผลผลิตในช่วงเช้าถอนต้นขึ้นช่ายออกจากแปลงปลูกทั้งต้นและราก หลังจากนั้นล้างรากให้สะอา","ส่วนกินใบ/ลำต้น","ขึ้นฉ่าย","19.png");


        myDb.InsertDataVeg("คะน้า","Kale","Brassica alboglabra","ลำต้นมีลักษณะตั้งตรงลำต้นมีลักษณะแข็งแรง อวบใหญ่ มีสีเขียวนวล คะน้ามีหลายลักษณะตามสายพันธุ์ที่ปลูก อาทิ คะน้าใบกลม คะน้าใบแหลม บางพันธุ์มีลักษณะก้านใบยาวหรือสั้น การแตกของใบจะแตกออกจากลำต้นเรียงสลับกัน 4-6 ใบ/ลำต้น ผิวใบมีลักษณะเป็นคลื้น ผิวเป็นมัน สีเขียวอ่อนถึงเขียวแก่ ถือเป็นส่วนนี่นิยมนำมาบริโภครองลงมาจากส่วนยอด บริเวณที่ถัดจากใบสุดท้ายที่เติบโตแยกออกมาอย่างเห็นได้ชัด ซึ่งจะเป็นส่วนของยอดที่มีลักษณะเป็นใบอ่อนขนาดเล็ก 2-3 ใบ มีลักษณะคล้ายบัวตูม ขนาดเล็กสีเขียวอ่อน รอที่จะเติบโตเป็นใบแก่ ถือเป็นส่วนที่นิยมนำมาบริโภคมากที่สุด",
                "คะน้ามีวิตามินหลายชนิด ช่วยลดความเสี่ยงต่อการเกิด มะเร็งกระเพาะอาหาร มะเร็งลำไส้ มะเร็งปอด ","ระยะปลูก ให้ต้นห่างกันประมาณ 20 - 30 เซนติเมตรอัตรา 1 - 1.5 กิโลกรัม/ไร่\n" +
                        "การเตรียมดิน ไถดินลึกประมาณ 20 - 30 เซนติเมตรตากดินไว้ 7 - 10 วัน แล้วย่อยดินให้ละเอียดใส่ปุ๋ยคอกหรือปุ๋ยหมัก อัตรา 2,000 กิโลกรัม/ไร่ และปุ๋ยสูตร 15 - 15 - 15 อัตรา 50 กิโลกรัม/ไร่ คลุกเคล้าให้เข้ากันแล้วปรับดินให้เรียบยกแปลงให้สูงประมาณ 20 เซนติเมตร กว้าง 1.20 เมตร\n" +
                        "การเตรียมกล้า นิยมใช้หว่านเมล็ดโดยหว่านให้สม่ำเสมอถอนแยก\n" +
                        "วิธีปลูก คลุมฟางรดน้ำให้ชุ่ม หว่านเมล็ดคะน้าให้ทั่วแปลง และสม่ำเสมอ โดย 1 ไร่ ใช้เมล็ดพันธุ์ 2 กิโลกรัม รดน้ำตามให้ชุ่ม เมื่อต้นกล้าอายุได้ 15 - 20 วันจึงถอนแยกให้มีระยะห่างตามกำหนด","การใส่ปุ๋ย ใส่ปุ๋ยสูตร 40 - 0 - 0 หรือ อัตรา 25 – 7- 7 อัตรา 30 กิโลกรัม/ไร่ เมื่ออายุ 7 วัน ใส่ปุ๋ยเคมี สูตร 15 - 15 - 15 ในอัตรา 30 - 40 กิโลกรัม/ไร่ ทุก 10 - 15 วันและรดน้ำตามทันที\n" +
                        "การเก็บเกี่ยว เก็บเกี่ยวเมื่ออายุ40 — 45 วัน หลังจากปลูกเป็นคะน้าที่โตเต็มที่ ส่วนคะน้าอ่อนหรือที่เรียกว่ายอดคะน้า จะเก็บเกี่ยวได้ในช่วงอายุประมาณ 30 วัน","ส่วนกินใบ/ลำต้น","คะน้า","20.png");


        myDb.InsertDataVeg("คะน้าฮ้องกง","Kailaan","Brassica oleracea var.","ลำต้นและใบมีสีเขียวเข้มมีขนาดเล็กกว่าคะน้า ยอดดอยคำ\n" +
                "ใบมีลักษณะเรียว ไม่กลม ดอกมีสีขาวหรือสีเหลืองทั้งนี้ขึ้นอยู่กับสายพันธุ์","ช่วยบำรุงโลหิต ธาตุเหล็กและธาตุโฟเลตในผักคะน้ามีความสำคัญต่อการสร้างเม็ดเลือดแดง","ระยะปลูก ใช้ระยะปลูก 15*15 เซนติเมตร \n" +
                "การเตรียมดิน ใช้จอบขุดพลิกหน้าดินลึก 15 – 20 เซนติเมตร หรือใช้รถใถเดินตามไถพรวนหน้าดินให้ละเอียด ตากดินทิ้งไว้ 7 – 10 วัน ขึ้นแปลงขนาดกว้าง  1 – 1.5 เมตร หรือตามสภาพพื้นที่ดิน ใส่ปุ๋ยรองพื้นโดยใช้ปุ๋ยคอก (มูลไก่) หรือปุ๋ยหมักอัตรา 3 กิโลกรัม/ตารางเมตร และหว่านปุ๋ยเคมี สูตร 15 – 15 – 15 หรือสูตร 16 – 16 – 16 อัตรา 120 กรัม/ตารางเมตร คลุกเคล้าปุ๋ยให้เข้ากับดินปลูก\n" +
                "การเตรียมกล้า หยอดเมล็ดลงในถาดหลุมเพาะกล้าโดยตรง หลักจาต้นกล้ามีอายุประมาณ 18 – 21 วัน หรือมีใบจริงอย่างน้อย 2 – 3 ใบจึงทำการย้ายปลูก ก่อนนำกล้าไปปลูก 4 – 5 วันควรให้น้ำน้อยลงเพื่อเตรียมต้นกล้าให้ปรับตัวในสภาพแปลงปลูกและพ่นสารเคมีป้องกันกำจัดศัตรูพืช 1 วัน ก่อนย้ายปลูก\n" +
                "วิธีปลูก ย้ายต้นกล้าลงแปลงปลูก โดยการถอนแยกต้นกล้าจากถาดหลุด (ควรทำด้วยความระมัดระวัง) นำมาปลูก จะทำการย้ายกล้าในช่วงเย็น เพราะทำให้ต้นกล้าตั้งตัวได้เร็วและหลังจากยย้ายต้นกล้าควรให้น้ำทันที","การใส่ปุ๋ย เนื่องจากคะน้าฮ้องกงเป้นผักกินใบในระยะแรก จึงต้องการปุ๋ยไนโตรเจน ค่อนข้างสูงใส่ปุ๋ยครั้งที่  1 หลังย้ายแปลงปลูก  7 – 10 วัน สูตร 46 – 0 – 0 หรือ 21 – 0 – 0 อัตรา 120 กรัม/ตารางเมตรใส่ปุ๋ยครั้งที่ 2 หลังย้ายแปลงปลูก 14 – 20 วัน สูตร 46 – 0 – 0 หรือ 21 – 0 – 0 ผสมปุ๋ยสูตร 15 – 15 – 15 อัตรา 2 : 1 สาในอัตรา 120 กรัม/ตารางเมตร\n" +
                "การเก็บเกี่ยว คะน้าฮ้องกงสามารถเก็บเกี่ยวเมื่ออายุประมาณ 35 – 45 วัน ตั้งแต่เริ่มเพาะกล้าหรือ เมื่อเริ่มมีดอก","ส่วนกินใบ/ลำต้น","คะน้าฮ้องกง","21.png");


        myDb.InsertDataVeg("ชะอม","Climbing Wattle","Acacia pennata (L.) Will.subsp.insuavis Nielsen","เป็นไม้พุ้มขนาดย่อมกึ่งเลี้อยและกิ้งก้านมีหนามแหลมอยู่ทั่วไป ใบเป็นใบประกอบ\n" +
                "ดอกชะอมออกเป็นช่อ แทงออกเหนือซอกใบบริเวณปลายยอด ดอกมีขนาดเล็ก สีขาว มีเกสรตัวผู้เป็นเส้นเล็Aกๆภายในดอก","1.ช่วยต่อต้านอนุมูลอิสระ เนื่องจากมีวิตามินเอสูง\n" +
                "2.ยอดชะอมช่วยลดความร้อนในร่างกายได้ ช่วยในการขับถ่าย ป้องกันโรคท้องผูก","ระยะปลูก โดยใช้ระยะปลูก 50*50 เซนติเมตร\n" +
                "การเตรียมดิน ขุดหลุมปลูกระยะ 1*2 เมตร \n" +
                "การเตรียมกล้า เลือกตัดกกิ่งชะอมที่ไม่อ่อน หรือแก่จนเกินไปตัดเป็นท่อนขนาดยาวประมาณ 30 เซนติเมตร\n" +
                "วิธีปลูก นำกิ่งชะอมที่เตรียมไว้วางเอียง 45 องศา ลงในหลุมที่เตรียมใว้ แล้วกลบดินให้แน่น การปลูกชะอมนิยมทำในฤดูฝนเพราะไม่ต้องดูแลมากนัก ให้น้ำทุกๆ 7 – 10 วัน","การใส่ปุ๋ย ใส่ปุ๋ยสูตร 15 – 15 – 15 อัตรา 10 – 20 กรัมต่อหลุมทุกเดือน กำจัดวัชพืชพร้อมกับการพรวนดิน \n" +
                "การเก็บเกี่ยว เริ่มเกี่ยวได้เมื่อชะอมอายุ 3 เดือน ขึ้นไป เก็บได้ทุก 3 วันต่อครั้ง การตัดชะอมควรตัดในตอนเช้าตรู่ โดยใช้มีดบางและคนตัดเพื่อให้แผลที่ตัดเพื่อให้แผลที่ตัดไม่ช้ำในช่วงฤดูหนาวชะอมจะไม่ค่อยแตกยอด และควรเหลือยอดชะอมไว้ 3 – 4 ยอดเพื่อให้ปรุงอาหารต่อไป","ส่วนกินใบ/ลำต้น","ชะอม","22.png");


        myDb.InsertDataVeg("ตะไคร้","Lemongrass","Cymbopogon citratus (DC.) Stapf","ตะไคร้เป็นพืชที่มีอายุหลายปี ใบเรียวยาวมีกลิ่นหอม\n" +
                "ตะไคร้เป็นพืชที่ออกดอกยาก จึงไม่ค่อยพบเห็น ดอกตะไคร้ดอกจะออกดอกเป็นช่อกระจาย มีก้านช่อดอกยาว","1.มีส่วนช่วยในการขับเหงื่อ เป็นยาบำรุงธาตุไฟให้เจริญ มีสรรพคุณเป็นยาบำรุงธาตุ \n" +
                "2.ช่วยในการเจริญอาหาร","ระยะปลูก ขุดหลุมปลูกระยะ30 * 30 เซ็นติเมตร\n" +
                "การเตรียมดิน ไถพรวนดินและตากดินไว้ 7 – 10 วัน ย่อยดินให้ละเอียดใส่ปุ๋ยคอกหรือปุ๋ยหมักคลุกเคล้าให้เข้ากับดิน \n" +
                "การเตรียมกล้า นำพันธุ์ที่เตรียมไว้ตัดใบออกให้เหลือต้นยาวประมาณ  30 – 40 เซนติเมตร แช่น้ำประมาณ 5 – 7 วัน เพื่อให้รากงอก รากที่แก่เต็มที่จะเป็นสีเหลืองเข้ม\n" +
                "วิธีปลูก นำพันธุ์ที่เรียมไว้นำไปปลูกในแปลง วางต้นพันธุ์มห้เอียง 45 องศาไปด้านใดด้านหนึ่ง แล้วกลบดินจากนั้นรดน้ำให้ชุ่ม","การใส่ปุ๋ย หลังปลูกได้ประมาณ 30 วัน ก็ควรใส่ปุ๋ยสูตร 15 – 15 – 15 หรือ 45 – 0 – 0 อัตรา 50 กิโลกรัมต่อไร่\n" +
                "การเก็บเกี่ยว เมื่อตะไคร้อายุประมาณ 90 วัน","ส่วนกินใบ/ลำต้น","","23.png");


        myDb.InsertDataVeg("บัวบก","Gotu kola","Centella asiatica (L.) Urb.","งอกตรงจากดิน ในเดี่ยวออกเป็นกระจุก\n" +
                "ดอกบัวบกออกเป็นช่อที่ซอกใบของข้อ ช่อดอกมีรูปทรงช่อคล้ายร่ม อาจมีช่อเดี่ยวหรือมีประมาณ 2-5 ช่อ แต่ละช่อมีประมาณ 3-4 ดอก","บัวบกเป็นพืชที่มีแคลเซียมในระดับปานกลางถึงสูง แต่มีระดับสารออกซาเลตที่เป็นอันตรายต่อร่างกายในปริมาณต่ำ","ระยะปลูก ระยะ 15 * 15 เซนติเมตร \n" +
                "การเตรียมดิน ไถพรวนดินทำแปลงเช่นเดี่ยวกับการปลูกพืชผักขนาดของแปลงกว้างประมาณ 1 เมตร ยาวตามขนาดของพื้นที่ \n" +
                "การเตรียมกล้า เตรียมใบบัวบกที่มีรากงอกตามข้อของลำต้น \n" +
                "วิธีปลูก นำใบบัวบกที่เตรียมใว้นำมาปลูกตามระยะที่กำหนดไว้แล้วรดน้ำประมาณ 1 อาทิตย์ ","การใส่ปุ๋ย ประมาณ 1 – 2 อาทิตย์ ใส่ปุ๋ยเคมีสูตร 15 – 15 – 15\n" +
                "การเก็บเกี่ยว หลังจากปลูกประมาณ 60 – 90 วัน เริ่มเก็บเกี่ยวได้ ใช้เสียมเหล็กขุดเซาะบริเวณใต้รก แล้วดึงเอาต้นบัวบกออกมาล้างน้ำ ทำความสะอาด เก็บใบเหลืองออก","ส่วนกินใบ/ลำต้น","ตะไคร้","24.png");


        myDb.InsertDataVeg("ผักกาดขาวปลี","Chinese Cabbage","Brassica pekinensis","ลำต้นสั้น ไม่มีกิ่งแขนง ใบมีสีขาวถึงสีเขียวอ่อนเป็นผืนเดียวตลอด กาบใบหรือก้านใบกว้าง แบน มีสีขาว กรอบ มีน้ำมาก ใบจะห่อคล้ายปลี","1.หัวผักกาดขาว มีรสเผ็ดหวาน คุณสมบัติเย็น (เป็นยิน) \n" +
                "2.ช่วยย่อย  แก้ไอมีเสมหะ ไม่มีเสียง อาเจียนเป็นโลหิต ท้องเสีย","ระยะปลูก นิยมหว่านโดยจัดระยะปลูกระหว่างต้น 50 เซนติเมตร ระหว่างแถว 50 เซนติเมตร โดยใช้เมล็ดพันธุ์ 200- 250 กรัม/ไร่\n" +
                "การเตรียมดิน ไถดินลึก 30 เซนติเมตร ตากดินไว้ 1  2 อาทิตย์ แล้วย่อยดินให้ละเอียด หว่านปูนขาวในอัตรา 50- 100 กิโลกรัม/ไร่ใส่ปุ๋ย หมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ย สูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ ลุกคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร รดน้ำให้ชุ่ม\n" +
                "การเตรียมกล้า เตรียมเมล็ดพันธุ์ที่จะปลูก\n" +
                "วิธีปลูก คลุมด้วยฟาง รดน้ำให้ชุ่ม ปลูกแบบหว่านเมล็ดให้กระจายสม่ำเสมอทั่วแปลง เมื่อต้นกล้ามีอายุ 15 วันหรือมีใบจริง 3 - 4 ใบ จึงถอนแยกให้มีระยะตามกำหนด","การใส่ปุ๋ย ผักกาดขาวปีเป็นผักกินใบ จึงควรใส่ปุ๋ยที่มีสัดส่วนของธาตุไนโตเจฟอสฟอรัสและโปแตสเซียม ในอัตรา 2: 1 : 1 : เช่น 20-10-10 หรือสูตรใกล้เคียง อัตรา 50 กิโลกรัม/ไร่ แบ่งใส่ 2 ครั้ง ใส่ครั้งที่หนึ่ง เมื่ออายุ 7-10 วัน ใส่ครั้งที่ 2 เมื่ออายุ 20 วัน\n" +
                "การเก็บเกี่ยว ผักกาดขาวปลีมีอายุการเก็บเกี่ยว ประมาณ 45-50 วัน หลังหว่านเมล็ดใช้มีดตัดที่โคนต้น แล้วตัดแต่ง ใบที่เป็นโรคหรือถูกแมลงทำลายให้เหลือใบนอกไว้ประมาณ 2-3 ใบ เพื่อป้องกันการกระทบกระแทกในระหว่างการขนส่ง","ส่วนกินใบ/ลำต้น","ผักกาดขาวปลี","25.png");


        myDb.InsertDataVeg("ผักกาดเขียวกวางตุ้ง","Chinese Cabbage-PAI TSAI","Brassica chinensis Jusl var parachinensis (Bailey) Tsen & Lee","ลักษณะกลมรี อกเป็นช่อ ก้านช่อดอกใหญ่ยาว มีแขนงก้านย่อยมาก มีดอกย่อยออกที่ปลายยอด ดอกมีลักษณะเล็กๆ กลีบดอกมีสีเหลืองสด","1.ช่วยเสริมสร้างภูมิคุ้มกันให้กับร่างกาย\n" +
                "2.ช่วยบำรุงและรักษาสายตา","ระยะปลูก ระยะห่างระหว่างต้น 20 - 30 เซนติเมตร โดยใช้เมล็ดพันธุ์1 กิโลกรัม /ไร่\n" +
                "การเตรียมดิน ไถลึกประมาณ 15 - 20 เซนติเมตร ตากดินไว้ 5- 7 วัน แล้วย่อยดินให้ละเอียด ใส่ปุ๋ยคอกหรือปุ๋ยหมัก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15 - 15 - 15 อัตรา 50 กิโลกรัม/ไร่ แล้วปรับดินให้เรียบ ยกแปลงให้สูงประมาณ 20 เซนติเมตร กว้าง 1 เมตร ความยาวตามความเหมาะสม\n" +
                "การเตรียมกล้า เตรียมเมล็ดพันธุ์ที่จะปลูก\n" +
                "วิธีปลูก ปลูกแบบหว่านเมล็ดโดยตรง นิยมใช้ในการปลูกที่ยกร่อง ดังนั้น ก่อนหว่านเมล็ดควรผสมกับทรายเสียก่อน โดยเมล็ดพันธุ์ 1 ส่วน ผสมกับทรายละเอียด 3 ส่วน คลุมฟางรดน้ำแล้วหว่านเมล็ดให้กระจายทั่วแปลง จากนั้นรดน้ำตามให้ชุ่ม โดยใช้เมล็ดพันธุ์ 1 กิโลกรัม/ไร่ เมื่อต้นกล้าอายุได้ 20 วัน หรือมีใบจริง4 —5 ใบ จึงถอนแยกให้มีระยะห่างตามกำหนด","การใส่ปุ๋ย ผักกาดเขียวกวางตุ้ง/กวางตุ้งฮ่องเต้ เป็นผักกินใบและก้านใบ ดังนั้นควรใส่ปุ๋ยยูเรีย (46 – 0 - 0) หรือ 25 - 7 - 7 อัตรา 30 กิโลกรัม/ไร่ เพื่อเร่งการเจริญเติบโตทางใบ และก้านใบให้เร็วขึ้น หรือใช้ปุ๋ยสูตร 20 -11 - 11 หรือสูตรใกล้เคียงในอัตรา 30 - 50 กิโลกรัม/ไร่ หลังจากใส่ปุ๋ยทุกครั้งควรมีการรดน้ำตามทันทีอย่าให้ปุ๋ยเคมีตกค้างบนใบ\n" +
                "การเก็บเกี่ยว หลังหว่านเมล็ดพันธุ์ในแปลง ประมาณ30 - 35 วัน ก็สามารถเก็บเกี่ยวได้ให้คัดเลือกเก็บต้นที่ใหญ่สมบูรณ์ก่อนใช้มีดคมๆ ตัดที่โคนต้นพร้อมตัดแต่งใบแก่ โรคแมลงทำลายออก","ส่วนกินใบ/ลำต้น","ผักกาดเขียวกวางตุ้ง","26.png");


        myDb.InsertDataVeg("ผักกาดหัว","Daikon","Raphanus sativus Linn., Cv group Chinese radish"," สีขาวหรือสีอื่น เป็นใบเดี่ยวใบเรียวยาวปลายใบมนขอบใบเป็นคลื่นเว้าเข้าหลายหยัก ออกเป็นช่อแบบราซีม มีสีขาวหรือสีม่วงติดฝักชนิดผ่าแล่ง","1.ช่วยกระตุ้นความอยากอาหาร\n" +
                "2.ช่วยลดน้ำตาลในเลือด","ระยะปลูก หว่านโดยใช้อัตราเมล็ด พันธุ์ 2-3 กิโลกรัม/ไร่ ระยะปลูกที่เหมาะสม คือระยะระหว่างหลุมห่างกันประมาณ 25 เซนติเมตร ระยะระหว่างแถวห่างแถวห่างประมาณ 30 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30 - 40 เซนติเมตร ตากดินไว้ 1 - 2 อาทิตย์ แล้วย่อยดินให้ละเ อียด หว่านปูนขาวในอัตรา 100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15-15-15 อัตรา 30-50 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า หว่านให้ทั่วแปลงอย่างสม่ำเสมอ รดน้ำชุ่มแล้งคลุมฟางแห้งหรือหญ้าแห้งเพื่อช่วยรักษาดินในระยะแรก \n" +
                "วิธีปลูก  หลังต้นกล้างอกประมาณ 15 วัน หรือมีใบจริง 2-3 ใบ ให้ถอนแยกต้นให้ห่างกันตามระยะกำหนด","การใส่ปุ๋ย ปุ๋ยเหมาะสม คือ ปุ๋ย สูตร 13-13-21 หรือ 15-15-15 ใส่ในอัตรา 50-100 กิโลกรัม/ไร่ ทั้งนี้ต้องขึ้นอยู่กับความอุดมสมบูรณ์ของดิน การใส่ให้แบ่งใส่ 2 ครั้ง ครั้งแรกครึ่งหนึ่งใส่เป็น ปุ๋ยรองพื้นแล้วพรวนดินกลบลงในดิน ครั้งที่สองอีกครั้ง ที่เหลือใส่เมื่อต้นกล้าอายุประมาณ 20-25 วัน โดยใส่แบบโรยข้างต้น แล้วพรวนดินกลบ นอกจากนี้ในระยะเจริญเติบโตอาจใส่ปุ๋ยเสริมเช่น ยูเรียหรือแอมโมเนียมไนเตรท อัตรา 10 กิโลกรัม/ไร่\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยวประมาณ 45-60 วัน ถ้าถึงอายุการเก็บเกี่ยวแล้วให้รีบเก็บเกี่ยวทันที อย่าปล่อยเกินอายุ เพราะจะทำให้คุณภาพของหัวลดลง","ส่วนกินใบ/ลำต้น","ผักกาดหัว","27.png");


        myDb.InsertDataVeg("ผักกูด","Paco fern","Diplazium esculentum (Retz.) Sw.","ยอดอ่อนของไม้จำพวกเฟิร์น ลักษณะเป็นก่อราก\n" +
                "ก้านใบแตกจากรากเหง้าใต้ดิน ก้านใบยาว ","1.ช่วยเสริมสร้างร่างกายให้แข็งแรง\n" +
                "2.ช่วยเพิ่มภูมิคุ้มกันและช่วยต่อต้านอนุมูลอิสระ","ระยะปลูก ระยะปลุก 50 * 50 เซนติเมตร \n" +
                "การเตรียมดิน ไถแปลงพร้อมกับการใส่ปุ๋ยคอก แล้วขุดหลุมปลูก\n" +
                "การเตรียมกล้า เตรียมไหลหรือหัวผักกูด\n" +
                "วิธีปลูก นำไหลหรือหัวที่เตรียมไว้วางลงในหลุม แล้วเอาดินกลบโคลน เมื่อผักกูดเริ่มตั้งตัวได้","การใส่ปุ๋ย ใส่ปุ๋ยยูเรียผสมกับปุ๋ยสูตร 15 – 15 – 15 อัตรา 75 กิโลกรัมต่อไร่\n" +
                "การเก็บเกี่ยว เมื่อปลุกได้ 6 เดือน สามารถเก็บผลผลิดได้ โดยเก็บ 3 วัน ต่อครั้ง","ส่วนกินใบ/ลำต้น","ผักกูด","28.png");


        myDb.InsertDataVeg("ผักชี","Coriander","Coriandrum sativum L.","เป็นพืชล้มลุกขนาดเล็ก ใบติดกับลำต้นมีใบย่อยเป็นจำนวนมาก ดอกช่อ ดอกย่อยสีขาวอมชมพู","1.ช่วยบำรุงและรักษาสายตา\n" +
                "2.ช่วยให้เจริญอาหารมากยิ่งขึ้น","ระยะปลูก ระยะ 20 x 20 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินลึกประมาณ 15 - 20 เซนติเมตรตากดินทิ้งไว้ 7 - 15 วัน แล้วย่อยดินให้ละเอียดและปรับพื้นที่ให้สม่ำเสมอ ใส่ปุ๋ยคอกหรือปุ๋ยหมักประมาณ 2,000 กิโลกรัม/ไร่ และปุ๋ย สูตร 15 - 15  - 15 อัตรา 30 - 50 กิโลกรัม/ไร่\n" +
                "การเตรียมกล้า หว่านเมล็ด นำเมล็ดผักชีฝรั่งแช่น้ำไว้ 1 คืน \n" +
                "วิธีปลูก นำเมล็ดผักชีฝรั่งแช่น้ำไว้ 1 คืน หว่านให้ทั่วแปลงควรให้น้ำ 3 - 5 วัน/ครั้ง","การใส่ปุ๋ย ผักชีฝรั่ง อายุ 30 วัน ใส่ปุ๋ยสูตร 25 - 7 - 7 อัตรา 30 - 50 กิโลกรัม/ไร่ หลังจากนั้น 15 วัน ใส่ปุ๋ยสูตรเสมอ 15 – 15 - 15 หรือ 16 – 16 - 16 อัตรา 30 - 50 กิโลกรัม/ไร่\n" +
                "การเก็บเกี่ยว เก็บเกี่ยวเมื่ออายุประมาณ 120 วัน หลังหว่านเมล็ด และการแยกกอ 30 วัน นับจากการย้ายกล้า การเก็บผลผลิตถอนทั้งต้นมีรากติดมาด้วยทยอยเก็บผลผลิตต้นใหญ่ก่อน และทำการล้างดินออกจากรากและตัดแต่งใบที่เสียหรือเป็นโรคทิ้ง","ส่วนกินใบ/ลำต้น","ผักชี","29.png");


        myDb.InsertDataVeg("ผักชีฝรั่ง","Culantro","Eryngium foetidum L","ผักชีฝรั่งมีลำต้นเตี้ยติดดิน ใบออกรอบโคนต้น ไม่มีก้านใบ ใบรูปหอก ยาวรี โคนใบสอบลง ออกเป็นช่อ ก้านช่อดอกยาว แตกกิ่งช่อดอกตรงปลาย\n" +
                "ดอกมีลักษณะเป็นกระจุกกลม สีขาวอมเขียว ตรงโคนช่อดอกมีใบประดับรูปดาวมีรอยหยัก รองรับช่อดอกไว้","1.มีสารต่อต้านอนุมูลอิสระสูง ซึ่งช่วยชะลอการเสื่อมของเซลล์ต่าง ๆ ในร่างกาย\n" +
                "2.ช่วยบำรุงกระดูกและฟันให้แข็งแรง","ระยะปลูก ส่วนใหญ่จะหว่านเมล็ดลงแปลงปลูกที่ได้เตรียมไว้ อัตรา 5-6 กิโลกรัม/ไร่\n" +
                "การเตรียมดิน ผักชีเป็นพืชที่มีระบบรากตื้น ไถดินลึกเพียง 15-20 เซนติเมตร ตากดินทิ้งไว้ 5-7 วัน จากนั้นใส่ปุ๋ยคอกหรือปุ๋ยหมักอัตรา 2,000 กิโลกรัม/ไร่ แล้วคลุกเคล้าให้เข้ากัน และย่อยดินให้ละเอียดเพื่อสะดวกในการปลูก\n" +
                "การเตรียมกล้า เตรียมเมล็ดพันธุ์ให้พร้อมก่อน โดยการบดเมล็ดให้แตกก่อน แล้วจึงแช่น้ำไว้ 1 คืน\n" +
                "วิธีปลูก ก่อนปลูกรดน้ำให้ทั่วแปลงให้ชุ่ม นำเมล็ดผักชีที่แช่น้ำไว้ 1 คืนแล้ว มาหว่านลงบนแปลงปลูกที่เตรียมไว้คลุมด้วยฟางแห้งทับอีกชั้นเพื่อรักษาความชุ่ม ชื้นของดินแล้วรดน้ำอีกครั้ง ควรรดน้ำทุกเช้า – เย็น","การใส่ปุ๋ย ใส่ปุ๋ยสูตร 25 – 7 - 7 หรือใกล้เคียง โดยใส่อัตรา 20-30 กิโลกรัม/ไร่\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยวประมาณ 40 - 50 วัน นับจากวันปลูก ลักษณะที่เหมาะสมแก่การเก็บ คือในขณะที่ยังไม่ออกดอก","ส่วนกินใบ/ลำต้น","ผักชีฝรั่ง","30.png");
        myDb.InsertDataVeg("ผักบุ้งจีน","Ipomcea aquatica Forsk","Swamp Morning Glory, Water Morning Glory ","ใบมีลักษณะเป็นใบเดี่ยว ขอบใบเรียบ รูปใบคล้ายหอกเรียวยาวดอกผักบุ้งจีนออกเป็นช่อ เป็นดอกสมบูรณ์ แต่ละช่อประกอบด้วยดอกตรงกลาง 1 ดอก และเติบโตก่อน ส่วนด้านข้างมีอีก 2 ดอก "
                ,"1.เป็นผักที่มีวิตามินเอสูง\n" +
                        "2.ช่วยในการบำรุงสายตา","ระยะปลูก ส่วนใหญ่จะหว่านเมล็ดลงแปลงปลูกที่ได้เตรียมไว้\n" +
                        "การเตรียมดิน ไถพรวนดินและตากดินไว้ 7 – 10 วัน ย่อยดินให้ละเอียด\n" +
                        "การเตรียมกล้า ก่อนปลูกนำเมล็ดพันธุ์ผักบุ้งจีนไปแช่น้ำนาน 6 – 12 ชั่วโมง เพื่อให้เมล็ดพันธุ์ผักบุ้งจีนดูดซับน้ำเข้าไปในเมล็ด มีผลให้เมล็ดผักบุ้งจีนงอกเร็วขึ้นและสม่ำเสมอกันดี เมล็ดผักบุ้งจีนที่ลอยน้ำจะเป็นเมล็ดพันธุ์ผักบุ้งจีนที่ไม่สมบูรณ์ ไม่ควรนำมาเพาะปลูก ถึงแม้จะขึ้นได้บ้างแต่จะไม่สมบูรณ์แข็งแรง อาจจะเป็นแหล่งทำให้เกิดโรคระบาดได้ง่าย\n" +
                        "วิธีปลูก นำเมล็ดพันธุ์ผักบุ้งจีนที่ดีไม่ลอยน้ำ มาหว่านให้กระจายทั่วทั้งแปลงให้เมล็ดห่างกันเล็กน้อย จำนวนเมล็ดที่ใช้หว่านสำหรับแปลงปลูก 1 ไร่ ประมาณ 13 – 15 กิโลกรัมต่อไร่ หรือ 30 ลิตรต่อไร่ผักบุ้งจีนใช้เวลาในการงอกเพียง 48 ชั่วโมง ระยะแรกของการเจริญเติบโตจะให้ลำต้นตั้งตรง หลังจากงอกได้ 5 – 7 วัน จะมีใบเลี้ยงโผล่ออกมา 2 ใบ มีลักษณะปลายใบเป็นแฉกไม่เหมือนกับใบจริงเมื่อต้นโต ในระยะสองสัปดาห์แรกจะมีการเจริญเติบโตทางลำตน้ อย่างรวดเร็วจนกระทั่งอายุประมาณ 30 – 45 วันการเจริญเติบโตจะเปลี่ยนไปในทางทอดยอดและแตกกอ"
                ,"การใส่ปุ๋ย ผักบุ้งจีนเป็นพืชผักที่บริโภคใบและต้น มีอายุการเก็บเกี่ยวสั้น ถ้าดินปลูกมีความอุดมสมบูรณ์ หรือมีการใส่ปุ๋ยคอก เช่น มูลสุกรมูลเป็ด ไก่ เป็นต้น ซึ่งปุ๋ยคอกดังกล่าวเป็นปุ๋ยที่มีไนโตรเจนสูงอยู่แล้วไม่จำเป็นต้องใส่ปุ๋ยเคมีก็ได้แต่ถ้าดินปลูกไม่ค่อยอุดมสมบูรณ์ นอกจากต้องให้ปุ๋ยคอกแล้วควรมีการใส่ปุ๋ยทางใบที่มีไนโตรเจนสูง โดยหว่านปุ๋ยกระจายทั่วทั้งแปลงก่อนปลูก และหลังการปลูผักบุ้งจีนได้ประมาณ 7 – 10 วัน ซึ่งการให้ปุ๋ยครั้งที่ 2 นั้นหลังจากหว่านผักบุ้งจีนลงแปลงแล้ว จะต้องมีการรดน้ำแปลงปลูกผักบุ้งจีนทันที อย่าให้ปุ๋ยเกาะอยู่ที่ซอกใบ จะทำให้ผักบุ้งจีนใบไหม้ ในการใส่ปุ๋ยเคมีครั้งที่ 2 นั้น จะใช้วิธีการละลายน้ำรด3 – 5 วัน ต่อครั้งก็ได้ โดยใช้อัตราส่วนปุ๋ยยูเรีย 10 กรัมต่อน้ำ 20 ลิตร จะเป็นการช่วยให้ผักบุ้งจีนเจริญเติบโตดี และเก็บเกี่ยวได้เร็วขึ้น\n" +
                        "การเก็บเกี่ยว หลังจากหว่านเมล็ดพันธุ์ผักบุ้งจีนลงแปลงปลูกได้ 20 – 25 วัน ผักบุ้งจีนจะเจริญเติบโต มีความสูงประมาณ 30 – 35 เซนติเมตร ให้ถอนต้นผักบุ้งจีนออกจากแปลงปลูกทั้งต้นและราก ควรรดน้ำก่อนถอนต้นจะถอนผักบุ้งจีนได้สะดวก รากไม่ขาดมาก หลังจากนั้นล้างรากให้สะอาด เด็ดใบและแขนงที่โคนต้นออก นำมาผึ่งไว้ ไม่ควรไว้กลางแดด ผักบุ้งจีนจะเหี่ยวเฉาได้ง่าย จัดเรียงต้นผักบุ้งจีนเป็นมัด เตรียมบรรจุภาชนะเพื่อจัดส่งตลาดต่อไป","ส่วนกินใบ/ลำต้น","ผักบุ้งจีน","31.png");

        myDb.InsertDataVeg("ผักหวานบ้าน","Star gooseberry","Sauropus androgynus (L.) Merr. ","ขรุขระสีน้ำตาลกิ่งอ่อนสีเขียวเข้ม ผิวเรียบ ใบเป็นใบประกอบ ออกดอกเป็นช่อ โดยจะออกเป็นกระจุกตามซอกใบ เรียงไปตามก้านใบ ดอกเป็นดอกเดี่ยวแบบแยกเพศแต่อยู่บนต้นเดียว มีใบปรกอยู่ด้านบน","ตำรายาพื้นบ้านล้านนาจะใช้รากผักหวานเข้าตำรับยารักษาอาการที่เกิดจากธาตุไฟ ได้แก่ โรคขางทุกชนิด (อาการแสดงของธาตุไฟกระทำโทษ) เช่น ขางทำให้มีอาการเสียดด้านข้าง เสียดท้อง ไอ ร้อน ง่วงนอน ขางไฟ ขางแกมสาน ขางรำมะนาดเจ็บในคอ ขางปิเสียบ เป็นอาการจุกเสียดและร้อน ใจสั่น เป็นต้น หรือใช้รักษามะเร็งก้อนเนื้อหรือเนื้องอกที่ผิดปกติ ฝีสาร ซึ่งจะใช้เป็นยาชะล้างฝีที่มีอาการร้อน และยังใช้เข้าตำรับยารักษามะเร็งไฟ มะเร็งคุด สันนิบาตฝีเครือ "
                ,"ระยะปลูก ใช้ระยะปลูก 1 * 2 เมตร\n" +
                        "การเตรียมดิน นำปุ๋ยคอกที่แห้งดีแล้วผสมตอนเตรียมดินประมาณ 1 – 2 กิโลกรัมต่อหลุม และใส่ปุ๋ยเคมีสูตร 15 – 15 – 15 อัตรา 10 - 20 กิโลหรัมต่อหลุมรองก้นหลุมก่อนปลูก \n" +
                        "การเตรียมกล้า ใช้กิ่งปักชำหรือเพาะกล้าด้วยเมล็ด\n" +
                        "วิธีปลูก เมื่อต้นกล้าอายุได้ 45 – 60 วัน นำต้นกล้ามาปลูกในหลุมที่เตรียมไว้","การใส่ปุ๋ย เมื่อผักหวานบเนอายุได้ 90 วัน ควรจะใส่ปุ๋ยเสริมสูตร 21 – 0 – 0 อัตรา 10 – 20 กรัมต่อหลุม จำนวน 3 ครั้งต่อปี\n" +
                        "การเก็บเกี่ยว สามารถเก็ยเกี่ยวผลผลิตได้ หลักจากย้ายปลุก 60 วัน เมื่อเก็บยอกไปแล้วประมาณ 15 วัน จะแตกยอดใหม่ ให้เก็บได้ตลอดปี","ส่วนกินใบ/ลำต้น","ผักหวานบ้าน","32.png");

        myDb.InsertDataVeg("แมงลัก","Lemon basil","Ocimum × africanum Lour. ","เป็นพืชล้มลุกมีใบเล็ก สีอ่อน บอบบางช้ำง่ายและเหี่ยวง่าย\n" +
                "จะออกดอกเป็นช่อ มีช่อดอกยาวประมาณ 5-15 ซม. แบ่งเป็นข้อๆ","1.ใบแมงลักช่วยแก้อาการวิงเวียนศีรษะได้\n" +
                "2.ช่วยแก้อาการท้องอืดท้องเฟ้อ ด้วยการใช้ใบสดมาล้างน้ำให้สะอาดแล้วรับประทาน","ระยะปลูก ระหว่างต้น 40 เซนติเมตร ระหว่างแถว 40 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30-40 เซนติเมตร ตากดินไว้ 1-2 อาทิตย์ ย่อยดินให้ละเอียด หว่านปูนขาว ในอัตรา 100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา 2,000 กิโลกรัม/ไร่ ปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตรกว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า หว่านเมล็ดพันธุ์\n" +
                "วิธีปลูก เมื่อเมล็ดงอกขึ้นมา อายุ 1 เดือนจะสูงประมาณ 1 ฟุต ก็นำปลูกลงแปลงปลูกที่เตรียมดินไว้เมื่อถอนขึ้นมาก่อนนำไปปลูกลงดินต้องตัดยอดทิ้งก่อนหรืออาจตัดออกครึ่งต้นก็ได้ถ้าจะดียิ่งขึ้นควรตัดแต่งรากด้วย เพราะแมงลักที่ตัดแต้ง รากจะงอกงามกว่า แต่ทั้งนี้เวลานำไปปลูกต้องรดน้ำด้วย ใช้ปลูกหลุมสละ 1-2 ต้น เมื่อต้นแมงลักเติบโตแตกกิ่งก้านใบก็จะคลุมถึงกันหมด","การใส่ปุ๋ย ครั้งแรกใส่ปุ๋ย 25-7-7 หรือ 46-0-0 หลังเพาะกล้า 7 วัน และครั้งที่สองใส่ปุ๋ย สูตร 15-15-15 หรือ 20-11-11 ในอัตรา 25-30 กิโลกรัม/ไร่ หลังจากครั้งแรก 15 วัน\n" +
                "การเก็บเกี่ยว เมื่ออายุได้ 40-45 วัน ก็ตัดกิ่งนำไปบริโภคหรือขายได้","ส่วนกินใบ/ลำต้น","แมงลัก","33.png");

        myDb.InsertDataVeg("สาระแหน่","Kitchen Mint","Mentha × villosa Huds.","เลื้อยไปตามดินมีขนสั้นปกคลุมทุกส่วนของลำต้นใบเป็นใบเดี่ยว ออกตรงกันข้าม \n" +
                "ออกดอกเป็นช่อ เหนือซอกใบบริเวณปลายยอด แต่ละช่อมีดอกจำนวนมาก ดอกมีสีชมพูอมม่วง ประกอบด้วยกลีบเลี้ยง 5 กลีบ และกลีบดอกที่เชื่อมติดกันเป็นกรวยตื้น 4 กลีบ ภายในดอกมีเกสรตัวผู้ 4 อัน ส่วนเกสรตัวเมียจะไม่ค่อยพบ","1.ช่วยบรรเทาอาการและแก้หวัด น้ำมูกไหล\n" +
                "2.ช่วยรักษาโรคหอบหืด","ระยะปลูก ระยะระหว่างต้น 30 – 40 เซนติเมตร\n" +
                "การเตรียมดิน ไถพรวนแล้วตากดินไว้ 7 วัน ยกร่องรดน้ำให้ดินชืนแล้วขุดหลุมปลูก\n" +
                "การเตรียมกล้า เตรียมต้นกล้าที่สมบูรณ์\n" +
                "วิธีปลูก นำต้นพันธุ์ที่เตรียมไว้วางลงในหลุม ปลูกกลบดินให้แน่นแล้วรดน้ำ สะระแหน่ชอบชื้น แต่ไม่ชอบแฉะ จึงต้องคอยดูไม่ให้ดินแห้ง","การใส่ปุ๋ย ในช่วงแรกใส่ปุ๋ยยูเรียผสมปุ๋ยผสม 16 – 16 – 16 ในอัตรา 1 : 1 หว่านแลงบางๆ แล้วรดน้ำให้ชุ่ม เมื่อเจริญเติบโตปุ๋ยสูตร 16 – 16 – 16 ในอัตรา 50 กิโลกรัมต่อไร่ โดยแบ่งใส่เดือนละ 3 ครั้ง\n" +
                "การเก็บเกี่ยว หลังจากปลูกประมาณ 45 วัน ก้เก็บเกี่วได้โดยใช้มีดคมๆ ตัด หลังจากตัดแล้ว 20 วัน จะสามารถตัดใหม่ได้อีก ก่อนตัดควรงดใส่ปุ๋ยเพราะต้นจะเน่า","ส่วนกินใบ/ลำต้น","สาระแหน่","34.png");

        myDb.InsertDataVeg("หอมแบ่ง","Green Shallot","Alliumcepa var. aggregatum ","เป็นพืชที่มีลำต้นใต้ดินใบของหอมแบ่งเรียวแหลมมีกาบใบล้อมรอบ\n" +
                "ส่วนของกาบห่อหุ้มต้นทำให้มีลักษณะพองโตเป็นหัว ซึ่งจะอยู่รวมกันเป็นกลุ่ม ใบของหอมแบ่งเรียวแหลม ภายในกลวงตั้งอยู่บนฐานของหัว\n" +
                "เป็นดอกสมบรูณ์เพศ ออกเป็นช่อ","1.แก้ไข้หวัด โรคหืดหอบ ไอเรื้อรั้ง\n" +
                "2.แก้หวัดคัดจมูก และช่วยลดน้ำมูก","ระยะปลูก ระยะระหว่างต้น 30 เซนติเมตร ระหว่างแถว 30 เซนติเมตร\n" +
                "การเตรียมดิน หอมแบ่งเป็นผักที่ระบบรากตื้น ไถดินลึกประมาณ 15 - 20 เซนติเมตร ตากดินทิ้งไว้ 5 - 7 วัน ใส่ปุ๋ยคอกหรือปุ๋ยหมัก 2,000 - 2,500 กิโลกรัม/ไร่ และรองพื้นปุ๋ยสูตร 15 - 15 - 15 หรือ 16 - 16 - 16 อัตรา 50 กิโลกรัม/ไร่\n" +
                "การเตรียมกล้า เตรียมหัวพันธุ์ในการปลูก \n" +
                "วิธีปลูก ปลูกระยะตามที่กำหนดควรดำหัวให้ลึกลงในดินเพียงครึ่งตัว ค่อยๆกดอย่างระมัดระวัง แล้วคลุมด้วยฟางแห้งหรือหญ้าแห้งเพื่อเก็บรักษาความชื้นและป้องกันกำจัดวัชพืช และรดน้ำให้สม่ำเสมอ","การใส่ปุ๋ย ช่วงแรกใส่ปุ๋ยสูตร 25 - 7 - 7 หรือสูตรใกล้เคียง โดยใส่อัตรา 30 - 50 กิโลกรัม/ไร่เมื่ออายุ 20 วัน และปุ๋ยสูตร 15 - 15 - 15 อัตรา 30 - 50 กิโลกรัม/ไร่ เมื่อต้นหอมอายุ 30 วัน\n" +
                "การเก็บเกี่ยว อายุการเก็บเกี่ยว 40 - 45 วัน โดยถอนทั้งต้น และทำการล้างดินออกจากราก และตัดแต่งใบที่เสียหรือเป็นโรคทิ้ง ","ส่วนกินใบ/ลำต้น","หอมแบ่ง","35.png");

        myDb.InsertDataVeg("โหระพา","Sweet basil","Ocimum basilicum L. ","เป็นไม้ล้มลุกลำต้นเป็นสี่เหลี่ยมมีกิ่งอ่อนสีม่วงแดง ใบเป็นใบเดี่ยวออกตรงข้าม รูปไข่หรือรูปรีกว้าง 3 - 4 เซนติเมตร ยาว 4 - 6 เซนติเมตร ปลายแหลม โคนมน ขอบจะเป็นฟันเลื่อยห่างๆ ดอกสีขาวหรือชมพูอ่อน\n" +
                "ออกเป็นช่อที่ปลายกิ่งยาว 7 - 12 เซนติเมตร ใบประดับสีเขียวอมม่วงจะคงอยู่เมื่อเป็นผล กลีบดอกโคยเชื่อมกัน ปลายแยกเป็น 2 ส่วน มีเกสรตัวผู้ 4 อัน","1. ช่วยป้องกันความเสียหายในร่างกายของเราจากการทำลายของอนุมูลอิสระ\n" +
                "2. ช่วยกระตุ้นการสร้างภูมิคุ้มกันให้แก่ร่างกาย","ระยะปลูก ระหว่างต้น 40 เซนติเมตร ระหว่างแถว 40 เซนติเมตร\n" +
                "การเตรียมดิน ไถดินให้ลึกประมาณ 30-40 เซนติเมตร ตากดินไว้ 1-2 อาทิตย์ ย่อยดินให้ละเอียด หว่านปูนขาว ในอัตรา 100-300 กิโลกรัม/ไร่ ใส่ปุ๋ยหมักหรือปุ๋ยคอก อัตรา2,000 กิโลกรัม/ไร่ ใส่ปุ๋ยหมัก ปุ๋ยสูตร 15-15-15 อัตรา 30 กิโลกรัม/ไร่ คลุกเคล้าให้ทั่วแล้วยกแปลงให้สูงประมาณ 30 เซนติเมตร กว้าง 120 เซนติเมตร\n" +
                "การเตรียมกล้า เตรียมกิ่งชำหรือเมล็ดพันธุ์\n" +
                "วิธีปลูก ใช้กิ่งชำหรือใช้เมล็ดเพาะเป็นต้นกล้าย้ายปลูกตามระยะห่างที่กำหนด","การใส่ปุ๋ย ใส่ปุ๋ยสูตร 15-15-15 หรือ 25-7-7 ในอัตรา 30-50 กิโลกรัม/ไร่ ทุกครั้งหลังเก็บเกี่ยว\n" +
                "การเก็บเกี่ยว ใช้มีดคม ๆ เก็บเกี่ยวตัดกิ่งที่เจริญเติบโตเต็มที่แล้ว ซึ่งในไม่ช้าโหระพาจะแตกกิ่งต้นออกมาเช่นเดิม(อายุเก็บเกี่ยว 40-45 วัน) สามารถเก็บเกี่ยวได้หลายครั้ง ในระยะที่ไม่ได้เก็บเกี่ยวผลผลิตควรมีการตัดดอกทิ้งเพื่อเร่งการเจริญเติบโตทางใบ","ส่วนกินใบ/ลำต้น","โหระพา","36.png");



        myDb.InsertDataVeg("กระเทียม","Garlic","Allium sativum L.","กระเทียมเป็นไม้ล้มลุกและใหญ่ยาว มีหัวใต้ดิน","1. ช่วยบำรุงผิวหนังให้มีสุขภาพดีและแข็งแรง\n" +
                "2. ช่วยเสริมสร้างการเจริญเติบโตของเนื้อเยื่อในร่างกาย","ระยะปลูก เตรียมแปลงกว้าง 1.20 เมตร สูง 0.20 เมตร ใส่ปูนขาว 200 – 300 กิโลกรัมต่อไร่ ใส่ปุ๋ยคอกปุ๋ยหมัก 2 – 3 ตันต่อไร่\n" +
                "การเตรียมดิน เตรียมแปลงกว้าง 1.20 เมตร สูง 0.20 เมตร ใส่ปูนขาว 200 – 300 กิโลกรัมต่อไร่ ใส่ปุ๋ยคอกปุ๋ยหมัก 2 – 3 ตันต่อไร่\n" +
                "การเตรียมกล้า เลือกกลีบไม่ฝ่อ ไม่มีโรค ไม่มีแมลง \n" +
                "วิธีปลูก คัดกลีบขนาดเท่ากันปลูกด้วยกัน ฝังกลีบกระเทียมลึกประมาณ 2 ใน 3 ของกลีบ ใช้ฟางคลุมแปลง","การใส่ปุ๋ย อายุ 10 – 14 วัน ใส่ปุ๋ยสูตร 46 – 0 – 0 หรือ 21 – 0 – 0 อัตรา 25 – 30 กิโลกรัมต่อไร่ \n" +
                "การเก็บเกี่ยว อายุ 90 – 120 วัน ก่อนเก็บเกี่ยว 2 – 3 สัปดาห์งดให้น้ำ เก็บเกี่ยวเมื่อใบเปลื่ยนเป็นสีเหลืองแห้งเหี่ยวลง ถอนหัวกระเทียบมัดก้านและใบรวมกันเป็นฟ่อน","ส่วนกินหิวและราก","กระเทียม","37.png");

        myDb.InsertDataVeg("ข่า","Galanga","Alpinia  galanga   (L.) Willd. ","พืชที่ลำต้นอยู่ใต้ดินเรียกว่าเหง้ามีข้อปล้องเห็นได้ชัดเป็นเนื้อในสีเหลือง มีกลิ่นหอม","1. เป็นยาแก้ท้องขึ้น ท้องอืดเฟ้อ ขับลม\n" +
                "2.เป็นยารักษากลากเกลื้อน โรคผิวหนัง ติดเขื้อแบคทีเรีย เชื้อรา","ระยะปลูก ระยะห่าง 1-1.2 เมตร\n" +
                "การเตรียมดิน ข่าชอบที่ดอก ดินร่วนวอุดมสมบูรณ์ และชุ่มชื่น แต่ไม่ชอบน้ำขังฤดูปลูกที่เหมาะสมคือต้นฤดูฝน พรวนดินให้ร่วนซุย\n" +
                "การเตรียมกล้า ขุดเหง้าข่าจากกอเดิมมาแบ่งให้เหง้ายาวประมาณ 15 -20 เซนติเมตร มีตา 2 – 3 ตา ตัดรากเก่าออกเพื่อให้รากใหม่เจริญเติบโตเต็มที่\n" +
                "วิธีปลูก ขุดหลุมลึกประมาณ 50 เซนติเมตร วางเหง้าลงในหลุมๆ ละ 2 -3 เหง้ากลับดินและรดน้ำให้ชุ่ม","การใส่ปุ๋ย เมื่อข่าอายุได้ 2 -3 เดือน หรือเริ่มแตกหน่อเหนือดินขึ้นมา ควรใส่ปุ๋ยสูตร 15 – 15 – 15 อัตรา 20 กรัมต่อหลุม\n" +
                "การเก็บเกี่ยว ข่าอายุ 3 เดือน เก็บเป็นหน่อข่า อายุ 6 – 8 เดือน เป็นข่าอ่อน อายุ 1 ปีขึ้นไปเก็บเป็นข่าแก่ ในช่วงนี้ข่าจะให้ผลผลิตดี มีน้ำหนัก ถ้าดินแห้งควรมีการรดน้ำเพื่อสะดวกต่อการขุด หรือถอนและลดความเสียหายต่อเหง้าข่า","ส่วนกินหิวและราก","ข่า","38.png");

        myDb.InsertDataVeg("ขิง","Ginger","Zingiber officinale Roscoe ","เป็นพืชล้มลุก มีเหง้าใต้ดิน เปลือกนอกสีน้ำตาลแกมเหลืองเนื้อในสีนวลมีกลิ่นหอม","1. ช่วยรักษาอาการปวดศีรษะและไมเกรน ด้วยการรับประทานน้ำขิงบ่อย ๆ\n" +
                "2. ช่วยลดความอยากของผู้ติดยาเสพติดลงได้","ระยะปลูก ระยะห่างระหว่างสันร่อง ประมาณ 50 - 70 เซนติเมตร\n" +
                "การเตรียมดิน ขิงชอบดินเหนียวปนทรายอุดมสมบูรณ์ ค่อนข้างชุ่มชื้น แต่ระบายน้ำได้ดีไม่ชอบน้ำขังแฉะ แสงแดดพอควร\n" +
                "การเตรียมกล้า เตรียมพันธุ์ขิงโดนนำท่อนพันธุ์มาตัดเป็นท่อนๆแต่ละท่อนมีตา 3 – 5 ตา\n" +
                "วิธีปลูก วางให้ตาตั้งขึ้น คลุมฟางปิดทับ รดน้ำพอขุ่ม เมื่องอกแล้วนำมาวางให้ด้านที่แตกหน่อตั้งขึ้น กลบดิน และใช้ฟางคลุมตลอด ถ้าต้องการให้ขิงแตกหน่อดี และแง่งขิงแข็งแรงต้องกลบโคนในช่วงอายุ 2 – 3 เดือน ช่วงที่ฝนตกมากให้ระวัง แมลงศัตรูและโรคต่างๆที่จะตามมา","การใส่ปุ๋ย ปุ๋ยอินทรีย์ เช่น ปุ๋ยคอก ปุ๋ยหมัก ปุ๋ยพืชสดหรืออาจใส่กากถั่วต่างๆ ซึ่งจะใส่ในขณะทำการ เตรียมดินและใส่หลังจากปลูกขิงแล้ว 2 ครั้ง โดยครั้งแรกจะใส่หลังจากปลูกขิงได้ประมาณ 2 เดือน และครั้งหลังจะใส่ปุ๋ยเมื่อขิงมีอายุได้ 4 เดือน ซึ่งการใส่ปุ๋ยทั้งสองครั้งจะใช้ปุ๋ยในอัตราประมาณ 5,000-6,000 กิโลกรัมต่อไร่\n" +
                "การเก็บเกี่ยว ขิงอ่อนจะเริ่มเก็บเกี่ยวได้เมื่ออายุ 4 – 5 เดือน สำหรับขิงแก่จะเก็บเมื่ออายุ 10 – 12 เดือนหลังจากปลูก จะสงเกตได้จากใบและลำต้นเริ่มเหี่ยว เมื่อขิงอายุย่างเขดือนที่ 8 ในการเก็บเกี่ยว หากเป็นพื้นที่แห้งและแข็งให้รดน้ำที่แปลงเพื่อให้ดินมีความชื้น แล้วจึงใช้มือดึงถอนแง่งขิงขึ้นมาล้าง และตัดแต่งแง่งขิงแยกแง่งที่จะใช้ทำพันธุ์ โดนเลือกแง่งที่ปราศจากเชื้อโรคและแมลง ","ส่วนกินหิวและราก","ขิง","39.png");

        myDb.InsertDataVeg("หอมแดง","Shallot","Allium ascalonicum L. ","พืชที่มีลำต้นสั้นและฝังอยู่ใต้ดิน ดอกลักษณะเป็นช่อคล้ายร่ม ","1. ช่วยทำให้ร่างกายอบอุ่น\n" +
                "2.หอมแดงช่วยทำให้เจริญอาหาร ","ระยะปลูก การยกขนาดของแปลงให้มีขนาดกว้าง 1-1.5 เมตร ระยะห่างระหว่างต้นที่นิยมใช้ในการปลูกอยู่ที่ประมาณ 15-20 เซนติเมตร\n" +
                "การเตรียมดิน หว่านปุ๋ยคอก 3 – 5 ตันต่อไร่ แล้วไถก่อนปลูก หว่านปุ๋ย 15 – 15 – 15 อัตรา 50 กิโลกรัมต่อไร่ ให้หัวพันธุ์ 200 -300 กิโลกรัมต่อไร่\n" +
                "การเตรียมกล้า เตรียมหัวหอมแดงที่สมบูรณ์\n" +
                "วิธีปลูก ใช้ส่วนโคนจิ้มลงในดินครึ้งหัว ใช้เวลา 7 – 10 วันในการงอก","การใส่ปุ๋ย อายุ 14 วัน หลังปลูก ใส่ปุ๋ยสูตร 46–0-0 หรือ 21–0–0 อัตรา 20–25กิโลกรัมต่อไร่ อายุ 35–40 วัน หลังปลูกใส่ปุ๋ยสูตร 15–15–15 อัตรา 20–25 กิโลลกรัมต่อไร่\n" +
                "การเก็บเกี่ยว งดให้น้ำ 5 – 7 วัน ก่อนเก็บเกี่ยว อายุเก็บเกี่ยว 65 – 85 วัน สังเกตใบเริ่มเหลือง ถอนหัวออกจากแปลงโดยเก็บหัวที่แห้ง สีแดงเป็นมันใบแห้ง","ส่วนกินหิวและราก","หอมแดง","40.png");
*/
        // btnSave (Save)
        final ImageView save = (ImageView) findViewById(R.id.btnSave);


        save.setOnClickListener(new View.OnClickListener() {
            public void onClick(View v) {
                // If Save Complete
                if (SaveData()) {
                    // Open Form Main
                    AddVegActivityManager.this.finish();
                }
            }
        });




        // btnCancel (Cancel)
        final ImageView cancel = (ImageView) findViewById(R.id.backBtnA);
        cancel.setOnClickListener(new View.OnClickListener() {
            public void onClick(View v) {
                // Open Form Main
               AddVegActivityManager.this.finish();
            }
        });
/*
        final Button chooseImage = (Button) findViewById(R.id.btnChooseImage);
        chooseImage.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent intent = new Intent(Intent.ACTION_PICK);
                intent.setType("image/*");
                startActivityForResult(intent, REQUEST_CODE_GALLERY);
                if (checkSelfPermission(Manifest.permission.READ_EXTERNAL_STORAGE)
                        != PackageManager.PERMISSION_GRANTED) {

                    requestPermissions(new String[]{Manifest.permission.READ_EXTERNAL_STORAGE},
                            REQUEST_CODE_GALLERY);
                }

            }
        });
        }

    private byte[] imageViewToByte(ImageView image) {
        Bitmap bitmap = ((BitmapDrawable) image.getDrawable()).getBitmap();
        ByteArrayOutputStream stream = new ByteArrayOutputStream();
        bitmap.compress(Bitmap.CompressFormat.PNG, 100, stream);
        byte[] bytesArray = stream.toByteArray();
        return bytesArray;
    }

    @Override
    public void onRequestPermissionsResult(int requestCode, @NonNull String[] permissions, @NonNull int[] grantResults) {
        super.onRequestPermissionsResult(requestCode, permissions, grantResults);
        if (grantResults.length >= 0 && grantResults[0] == PackageManager.PERMISSION_GRANTED) {
            Intent intent = new Intent(Intent.ACTION_PICK);
            intent.setType("image/*");
            startActivityForResult(intent, REQUEST_CODE_GALLERY);

        } else {

            Toast.makeText(getApplicationContext(), "You don't have permissions to access file", Toast.LENGTH_SHORT).show();

        }
        return;

    }

    @Override
    protected void onActivityResult(int requestCode, int resultCode, Intent data) {
        super.onActivityResult(requestCode, resultCode, data);
        imageView = (ImageView) findViewById(R.id.ShowImage);
        if (requestCode == REQUEST_CODE_GALLERY && resultCode == RESULT_OK && data != null) {

            Uri uri = data.getData();

            try {
                InputStream inputStream = getContentResolver().openInputStream(uri);

                Bitmap bitmap = BitmapFactory.decodeStream(inputStream);
                imageView.setImageBitmap(bitmap);
            } catch (FileNotFoundException e) {
                e.printStackTrace();
            }

        }
        */
    }

    public boolean SaveData() {

        final EditText tVegNameTH = (EditText) findViewById(R.id.addNameTH);
        final EditText tVegNameCM = (EditText) findViewById(R.id.addNameCM);
        final EditText tVegNameSC = (EditText) findViewById(R.id.addNameSC);
        final EditText tVegStructure = (EditText) findViewById(R.id.addStructure);
        final EditText tVegNutrient = (EditText) findViewById(R.id.addNutrient);
        final EditText tVegPlant = (EditText) findViewById(R.id.addPlant);
        final EditText tVegTreatment = (EditText) findViewById(R.id.addTreatment);
        final EditText tNameImage = (EditText) findViewById(R.id.addNameImage);
        final EditText tPath = (EditText) findViewById(R.id.addPath);
        final EditText tVegType = (EditText) findViewById(R.id.addType);
        // Dialog
        final AlertDialog.Builder adb = new AlertDialog.Builder(this);
        AlertDialog ad = adb.create();


        // new Class DB
        final MyDB myDb = new MyDB(this);


        // Save Data
        long saveStatus;
        saveStatus = myDb.InsertDataVeg(
                tVegNameTH.getText().toString(),
                tVegNameCM.getText().toString(),
                tVegNameSC.getText().toString(),
                tVegStructure.getText().toString(),
                tVegNutrient.getText().toString(),
                tVegPlant.getText().toString(),
                tVegTreatment.getText().toString(),
                tNameImage.getText().toString(),
                tVegType.getText().toString(),
                tPath.getText().toString());
        if (saveStatus <= 0) {
            ad.setMessage("ไม่สำเร็จ");
            ad.show();
            return false;
        }
        myDb.close();
        Toast.makeText(AddVegActivityManager.this, "เพื่มข้อมูลเรียบร้อยแล้ว",
                Toast.LENGTH_SHORT).show();


        return true;

    }

}
